
#language: ru

@tree

Функциональность: Дымовые тесты

Контекст:
	И я подключаю TestClient "sd_test" логин "admin" пароль "007"

Сценарий: Открытие формы объкта "АвтоматическоеИзвлечениеТекстов"

	Дано Я открываю основную форму обработки "АвтоматическоеИзвлечениеТекстов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АвтоматическоеИзвлечениеТекстов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "АктивныеПользователи"

	Дано Я открываю основную форму обработки "АктивныеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АктивныеПользователи"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "БлокировкаРаботыПользователей"

	Дано Я открываю основную форму обработки "БлокировкаРаботыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки БлокировкаРаботыПользователей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ВводКонтактнойИнформации"

	Дано Я открываю основную форму обработки "ВводКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВводКонтактнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ВыгрузкаЗагрузкаEnterpriseData"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаEnterpriseData"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаEnterpriseData"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ВыполнениеОбменаДанными"

	Дано Я открываю основную форму обработки "ВыполнениеОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыполнениеОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ГрупповоеИзменениеРеквизитов"

	Дано Я открываю основную форму обработки "ГрупповоеИзменениеРеквизитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ГрупповоеИзменениеРеквизитов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ДоступныеАнкеты"

	Дано Я открываю основную форму обработки "ДоступныеАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДоступныеАнкеты"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ЖурналРегистрации"

	Дано Я открываю основную форму обработки "ЖурналРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналРегистрации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ЗагрузкаДанныхИзФайла"

	Дано Я открываю основную форму обработки "ЗагрузкаДанныхИзФайла"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаДанныхИзФайла"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ЗагрузкаКлассификатораБанков"

	Дано Я открываю основную форму обработки "ЗагрузкаКлассификатораБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаКлассификатораБанков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ЗагрузкаКурсовВалют"

	Дано Я открываю основную форму обработки "ЗагрузкаКурсовВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаКурсовВалют"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ЗагрузкаПравилРегистрацииОбъектов"

	Дано Я открываю основную форму обработки "ЗагрузкаПравилРегистрацииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаПравилРегистрацииОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ЗаменаИОбъединениеЭлементов"

	Дано Я открываю основную форму обработки "ЗаменаИОбъединениеЭлементов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаменаИОбъединениеЭлементов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ЗаполнениеГрафиковРаботы"

	Дано Я открываю основную форму обработки "ЗаполнениеГрафиковРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеГрафиковРаботы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ЗаполнениеКалендарныхГрафиков"

	Дано Я открываю основную форму обработки "ЗаполнениеКалендарныхГрафиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеКалендарныхГрафиков"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ЗащитаПерсональныхДанных"

	Дано Я открываю основную форму обработки "ЗащитаПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗащитаПерсональныхДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"

	Дано Я открываю основную форму обработки "ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ИнтерактивноеИзменениеВыгрузки"

	Дано Я открываю основную форму обработки "ИнтерактивноеИзменениеВыгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнтерактивноеИзменениеВыгрузки"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ИнформацияПриЗапуске"

	Дано Я открываю основную форму обработки "ИнформацияПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнформацияПриЗапуске"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "КартаМаршрутаБизнесПроцесса"

	Дано Я открываю основную форму обработки "КартаМаршрутаБизнесПроцесса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КартаМаршрутаБизнесПроцесса"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "КонвертацияОбъектовXDTO"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовXDTO"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовXDTO"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "КонвертацияОбъектовИнформационныхБаз"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "КонвертацияОбъектовРаспределенныхИнформационныхБаз"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовРаспределенныхИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовРаспределенныхИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ЛегальностьПолученияОбновлений"

	Дано Я открываю основную форму обработки "ЛегальностьПолученияОбновлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЛегальностьПолученияОбновлений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму обработки "НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "НастройкаРезервногоКопированияИБ"

	Дано Я открываю основную форму обработки "НастройкаРезервногоКопированияИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРезервногоКопированияИБ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "НастройкаРезервногоКопированияПриложения"

	Дано Я открываю основную форму обработки "НастройкаРезервногоКопированияПриложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРезервногоКопированияПриложения"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "НастройкиПользователей"

	Дано Я открываю основную форму обработки "НастройкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиПользователей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "НастройкиЦентраМониторинга"

	Дано Я открываю основную форму обработки "НастройкиЦентраМониторинга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиЦентраМониторинга"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "НерекомендуемаяВерсияПлатформы"

	Дано Я открываю основную форму обработки "НерекомендуемаяВерсияПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НерекомендуемаяВерсияПлатформы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ОценкаПроизводительности"

	Дано Я открываю основную форму обработки "ОценкаПроизводительности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОценкаПроизводительности"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ПанельАдминистрированияБСП"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияБСП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияБСП"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ПереносФайловВТома"

	Дано Я открываю основную форму обработки "ПереносФайловВТома"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПереносФайловВТома"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ПодключениеОбсуждений"

	Дано Я открываю основную форму обработки "ПодключениеОбсуждений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодключениеОбсуждений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ПоискИУдалениеДублей"

	Дано Я открываю основную форму обработки "ПоискИУдалениеДублей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПоискИУдалениеДублей"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ПолнотекстовыйПоискВДанных"

	Дано Я открываю основную форму обработки "ПолнотекстовыйПоискВДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПолнотекстовыйПоискВДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ПомощникИнтерактивногоОбменаДанными"

	Дано Я открываю основную форму обработки "ПомощникИнтерактивногоОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникИнтерактивногоОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ПомощникСозданияОбменаДанными"

	Дано Я открываю основную форму обработки "ПомощникСозданияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникСозданияОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ПрограммыЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму обработки "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "РаботаСФайлами"

	Дано Я открываю основную форму обработки "РаботаСФайлами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСФайлами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "РасширенныйВводКонтактнойИнформации"

	Дано Я открываю основную форму обработки "РасширенныйВводКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РасширенныйВводКонтактнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "РегистрацияИзмененийДляОбменаДанными"

	Дано Я открываю основную форму обработки "РегистрацияИзмененийДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РегистрацияИзмененийДляОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "РегламентныеИФоновыеЗадания"

	Дано Я открываю основную форму обработки "РегламентныеИФоновыеЗадания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РегламентныеИФоновыеЗадания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "РезервноеКопированиеИБ"

	Дано Я открываю основную форму обработки "РезервноеКопированиеИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РезервноеКопированиеИБ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "РезультатыОбновленияПрограммы"

	Дано Я открываю основную форму обработки "РезультатыОбновленияПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РезультатыОбновленияПрограммы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "РекомендацияПоПовышениюСкоростиРаботы"

	Дано Я открываю основную форму обработки "РекомендацияПоПовышениюСкоростиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РекомендацияПоПовышениюСкоростиРаботы"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СдвигГраницыИтогов"

	Дано Я открываю основную форму обработки "СдвигГраницыИтогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СдвигГраницыИтогов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "Сканирование"

	Дано Я открываю основную форму обработки "Сканирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки Сканирование"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СкрытиеКонфиденциальнойИнформации"

	Дано Я открываю основную форму обработки "СкрытиеКонфиденциальнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СкрытиеКонфиденциальнойИнформации"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СопоставлениеОбъектовИнформационныхБаз"

	Дано Я открываю основную форму обработки "СопоставлениеОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СопоставлениеОбъектовИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ТекущиеДела"

	Дано Я открываю основную форму обработки "ТекущиеДела"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТекущиеДела"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ТранспортСообщенийОбменаEMAIL"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаEMAIL"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаEMAIL"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ТранспортСообщенийОбменаFILE"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаFILE"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаFILE"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ТранспортСообщенийОбменаFTP"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаFTP"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаFTP"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "УдалениеПомеченныхОбъектов"

	Дано Я открываю основную форму обработки "УдалениеПомеченныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УдалениеПомеченныхОбъектов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "УниверсальныйОбменДаннымиXML"

	Дано Я открываю основную форму обработки "УниверсальныйОбменДаннымиXML"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УниверсальныйОбменДаннымиXML"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "УправлениеИтогамиИАгрегатами"

	Дано Я открываю основную форму обработки "УправлениеИтогамиИАгрегатами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеИтогамиИАгрегатами"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "УстановкаОбновлений"

	Дано Я открываю основную форму обработки "УстановкаОбновлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УстановкаОбновлений"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_АРМ_Руководителя"

	Дано Я открываю основную форму обработки "СД_АРМ_Руководителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_АРМ_Руководителя"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_МастерСозданияОбъектаОбслуживания"

	Дано Я открываю основную форму обработки "СД_МастерСозданияОбъектаОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_МастерСозданияОбъектаОбслуживания"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_ЗаполнениеГрафика"

	Дано Я открываю основную форму обработки "СД_ЗаполнениеГрафика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ЗаполнениеГрафика"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ОбновлениеВспомогательныхДанных"

	Дано Я открываю основную форму обработки "ОбновлениеВспомогательныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбновлениеВспомогательныхДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ВыгрузкаЗагрузкаДанныхXML"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхXML"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхXML"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "ЗамерСкоростиОткрытияФорм"

	Дано Я открываю основную форму обработки "ЗамерСкоростиОткрытияФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗамерСкоростиОткрытияФорм"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_РеорганизацияГеозон"

	Дано Я открываю основную форму обработки "СД_РеорганизацияГеозон"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_РеорганизацияГеозон"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "КонсольЗапросов"

	Дано Я открываю основную форму обработки "КонсольЗапросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонсольЗапросов"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_ОтправитьPush"

	Дано Я открываю основную форму обработки "СД_ОтправитьPush"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ОтправитьPush"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_ЗакрытиеОперДня"

	Дано Я открываю основную форму обработки "СД_ЗакрытиеОперДня"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ЗакрытиеОперДня"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_ФормированиеЦен"

	Дано Я открываю основную форму обработки "СД_ФормированиеЦен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ФормированиеЦен"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_Автопланировщик"

	Дано Я открываю основную форму обработки "СД_Автопланировщик"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_Автопланировщик"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_Путеводитель"

	Дано Я открываю основную форму обработки "СД_Путеводитель"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_Путеводитель"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_ОбработкаДанных"

	Дано Я открываю основную форму обработки "СД_ОбработкаДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ОбработкаДанных"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_КонтрольДня"

	Дано Я открываю основную форму обработки "СД_КонтрольДня"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_КонтрольДня"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_НачалоДня"

	Дано Я открываю основную форму обработки "СД_НачалоДня"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_НачалоДня"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "НагрузочноеТестирование"

	Дано Я открываю основную форму обработки "НагрузочноеТестирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НагрузочноеТестирование"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_ПечатьФорма6ЭГ"

	Дано Я открываю основную форму обработки "СД_ПечатьФорма6ЭГ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ПечатьФорма6ЭГ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_ПечатьФорма6ОФ"

	Дано Я открываю основную форму обработки "СД_ПечатьФорма6ОФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ПечатьФорма6ОФ"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_ПечатьФорма11АС"

	Дано Я открываю основную форму обработки "СД_ПечатьФорма11АС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ПечатьФорма11АС"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_ЗагрузкаПараметровМаршрута"

	Дано Я открываю основную форму обработки "СД_ЗагрузкаПараметровМаршрута"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ЗагрузкаПараметровМаршрута"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_ЗагрузкаДанныхИзВнешнихСистем"

	Дано Я открываю основную форму обработки "СД_ЗагрузкаДанныхИзВнешнихСистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ЗагрузкаДанныхИзВнешнихСистем"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_ЗагрузкаДанныхОборудованияБреминКагаз"

	Дано Я открываю основную форму обработки "СД_ЗагрузкаДанныхОборудованияБреминКагаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ЗагрузкаДанныхОборудованияБреминКагаз"
	И Я закрываю текущее окно


Сценарий: Открытие формы объкта "СД_СопоставлениеТарифовИВидовРабот"

	Дано Я открываю основную форму обработки "СД_СопоставлениеТарифовИВидовРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_СопоставлениеТарифовИВидовРабот"
	И Я закрываю текущее окно

