
#language: ru

@tree

Функциональность: Дымовые тесты

Контекст:
	И я подключаю TestClient "sd_test" логин "admin" пароль "007"
	И я закрыл все окна клиентского приложения
	Если это не начальная страница Тогда 
		И я закрываю текущее окно
	И я активизирую поле "ПолеHTML"
	
Сценарий: Открытие формы списка "Валюты" 

	Дано Я открываю основную форму списка справочника "Валюты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "Валюты"

	Дано Я открываю основную форму справочника "Валюты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыОтветовАнкет" 

	Дано Я открываю основную форму списка справочника "ВариантыОтветовАнкет"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтветовАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВариантыОтветовАнкет"

	Дано Я открываю основную форму справочника "ВариантыОтветовАнкет"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтветовАнкет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВариантыОтчетов" 

	Дано Я открываю основную форму списка справочника "ВариантыОтчетов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВариантыОтчетов"

	Дано Я открываю основную форму справочника "ВариантыОтчетов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииРасширений" 

	Дано Я открываю основную форму списка справочника "ВерсииРасширений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВерсииРасширений"

	Дано Я открываю основную форму справочника "ВерсииРасширений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВерсииФайлов" 

	Дано Я открываю основную форму списка справочника "ВерсииФайлов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВерсииФайлов"

	Дано Я открываю основную форму справочника "ВерсииФайлов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыКонтактнойИнформации" 

	Дано Я открываю основную форму списка справочника "ВидыКонтактнойИнформации"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКонтактнойИнформации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВидыКонтактнойИнформации"

	Дано Я открываю основную форму справочника "ВидыКонтактнойИнформации"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКонтактнойИнформации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВидыПроверок" 

	Дано Я открываю основную форму списка справочника "ВидыПроверок"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПроверок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВидыПроверок"

	Дано Я открываю основную форму справочника "ВидыПроверок"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПроверок"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнешниеКомпоненты" 

	Дано Я открываю основную форму списка справочника "ВнешниеКомпоненты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеКомпоненты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВнешниеКомпоненты"

	Дано Я открываю основную форму справочника "ВнешниеКомпоненты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеКомпоненты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВнешниеПользователи" 

	Дано Я открываю основную форму списка справочника "ВнешниеПользователи"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеПользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВнешниеПользователи"

	Дано Я открываю основную форму справочника "ВнешниеПользователи"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеПользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВопросыШаблонаАнкеты" 

	Дано Я открываю основную форму списка справочника "ВопросыШаблонаАнкеты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВопросыШаблонаАнкеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВопросыШаблонаАнкеты"

	Дано Я открываю основную форму справочника "ВопросыШаблонаАнкеты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВопросыШаблонаАнкеты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ВстречаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВстречаПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВстречаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВстречаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВстречаПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ВстречаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыВнешнихПользователей" 

	Дано Я открываю основную форму списка справочника "ГруппыВнешнихПользователей"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыВнешнихПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ГруппыВнешнихПользователей"

	Дано Я открываю основную форму справочника "ГруппыВнешнихПользователей"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыВнешнихПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыДоступа" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступа"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ГруппыДоступа"

	Дано Я открываю основную форму справочника "ГруппыДоступа"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыИсполнителейЗадач" 

	Дано Я открываю основную форму списка справочника "ГруппыИсполнителейЗадач"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыИсполнителейЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ГруппыИсполнителейЗадач"

	Дано Я открываю основную форму справочника "ГруппыИсполнителейЗадач"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыИсполнителейЗадач"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ГруппыПользователей" 

	Дано Я открываю основную форму списка справочника "ГруппыПользователей"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ГруппыПользователей"

	Дано Я открываю основную форму справочника "ГруппыПользователей"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыПользователей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ДополнительныеОтчетыИОбработки" 

	Дано Я открываю основную форму списка справочника "ДополнительныеОтчетыИОбработки"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ДополнительныеОтчетыИОбработки"

	Дано Я открываю основную форму справочника "ДополнительныеОтчетыИОбработки"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗакладкиВзаимодействий" 

	Дано Я открываю основную форму списка справочника "ЗакладкиВзаимодействий"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ЗакладкиВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗакладкиВзаимодействий"

	Дано Я открываю основную форму справочника "ЗакладкиВзаимодействий"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ЗакладкиВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Заметки" 

	Дано Я открываю основную форму списка справочника "Заметки"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника Заметки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "Заметки"

	Дано Я открываю основную форму справочника "Заметки"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника Заметки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗапланированноеВзаимодействиеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСвойствОбъектов" 

	Дано Я открываю основную форму списка справочника "ЗначенияСвойствОбъектов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗначенияСвойствОбъектов"

	Дано Я открываю основную форму справочника "ЗначенияСвойствОбъектов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЗначенияСвойствОбъектовИерархия" 

	Дано Я открываю основную форму списка справочника "ЗначенияСвойствОбъектовИерархия"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектовИерархия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗначенияСвойствОбъектовИерархия"

	Дано Я открываю основную форму справочника "ЗначенияСвойствОбъектовИерархия"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектовИерархия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовМетаданных" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыОбъектовМетаданных"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовМетаданных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ИдентификаторыОбъектовМетаданных"

	Дано Я открываю основную форму справочника "ИдентификаторыОбъектовМетаданных"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовМетаданных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовРасширений" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыОбъектовРасширений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ИдентификаторыОбъектовРасширений"

	Дано Я открываю основную форму справочника "ИдентификаторыОбъектовРасширений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Календари" 

	Дано Я открываю основную форму списка справочника "Календари"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника Календари"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "Календари"

	Дано Я открываю основную форму справочника "Календари"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника Календари"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлассификаторБанков" 

	Дано Я открываю основную форму списка справочника "КлассификаторБанков"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторБанков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "КлассификаторБанков"

	Дано Я открываю основную форму справочника "КлассификаторБанков"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторБанков"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "КлючевыеОперации" 

	Дано Я открываю основную форму списка справочника "КлючевыеОперации"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника КлючевыеОперации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "КлючевыеОперации"

	Дано Я открываю основную форму справочника "КлючевыеОперации"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника КлючевыеОперации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "НаборыДополнительныхРеквизитовИСведений" 

	Дано Я открываю основную форму списка справочника "НаборыДополнительныхРеквизитовИСведений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыДополнительныхРеквизитовИСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НаборыДополнительныхРеквизитовИСведений"

	Дано Я открываю основную форму справочника "НаборыДополнительныхРеквизитовИСведений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыДополнительныхРеквизитовИСведений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЗаданий" 

	Дано Я открываю основную форму списка справочника "ОчередьЗаданий"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОчередьЗаданий"

	Дано Я открываю основную форму справочника "ОчередьЗаданий"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередьЗаданийОбластейДанных" 

	Дано Я открываю основную форму списка справочника "ОчередьЗаданийОбластейДанных"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданийОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОчередьЗаданийОбластейДанных"

	Дано Я открываю основную форму справочника "ОчередьЗаданийОбластейДанных"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданийОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПапкиФайлов" 

	Дано Я открываю основную форму списка справочника "ПапкиФайлов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПапкиФайлов"

	Дано Я открываю основную форму справочника "ПапкиФайлов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПапкиЭлектронныхПисем" 

	Дано Я открываю основную форму списка справочника "ПапкиЭлектронныхПисем"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиЭлектронныхПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПапкиЭлектронныхПисем"

	Дано Я открываю основную форму справочника "ПапкиЭлектронныхПисем"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиЭлектронныхПисем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Пользователи" 

	Дано Я открываю основную форму списка справочника "Пользователи"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "Пользователи"

	Дано Я открываю основную форму справочника "Пользователи"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПользовательскиеНастройкиОтчетов" 

	Дано Я открываю основную форму списка справочника "ПользовательскиеНастройкиОтчетов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПользовательскиеНастройкиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПользовательскиеНастройкиОтчетов"

	Дано Я открываю основную форму справочника "ПользовательскиеНастройкиОтчетов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПользовательскиеНастройкиОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПоставляемыеДанные" 

	Дано Я открываю основную форму списка справочника "ПоставляемыеДанные"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДанные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПоставляемыеДанные"

	Дано Я открываю основную форму справочника "ПоставляемыеДанные"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДанные"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаОбработкиЭлектроннойПочты" 

	Дано Я открываю основную форму списка справочника "ПравилаОбработкиЭлектроннойПочты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбработкиЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПравилаОбработкиЭлектроннойПочты"

	Дано Я открываю основную форму справочника "ПравилаОбработкиЭлектроннойПочты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбработкиЭлектроннойПочты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПравилаПроверкиУчета" 

	Дано Я открываю основную форму списка справочника "ПравилаПроверкиУчета"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаПроверкиУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПравилаПроверкиУчета"

	Дано Я открываю основную форму справочника "ПравилаПроверкиУчета"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаПроверкиУчета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетов" 

	Дано Я открываю основную форму списка справочника "ПредопределенныеВариантыОтчетов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПредопределенныеВариантыОтчетов"

	Дано Я открываю основную форму справочника "ПредопределенныеВариантыОтчетов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетовРасширений" 

	Дано Я открываю основную форму списка справочника "ПредопределенныеВариантыОтчетовРасширений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетовРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПредопределенныеВариантыОтчетовРасширений"

	Дано Я открываю основную форму справочника "ПредопределенныеВариантыОтчетовРасширений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетовРасширений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрограммыЭлектроннойПодписиИШифрования" 

	Дано Я открываю основную форму списка справочника "ПрограммыЭлектроннойПодписиИШифрования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПрограммыЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму справочника "ПрограммыЭлектроннойПодписиИШифрования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПроизводственныеКалендари" 

	Дано Я открываю основную форму списка справочника "ПроизводственныеКалендари"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеКалендари"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПроизводственныеКалендари"

	Дано Я открываю основную форму справочника "ПроизводственныеКалендари"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеКалендари"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофилиГруппДоступа" 

	Дано Я открываю основную форму списка справочника "ПрофилиГруппДоступа"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПрофилиГруппДоступа"

	Дано Я открываю основную форму справочника "ПрофилиГруппДоступа"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиГруппДоступа"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ПрофилиКлючевыхОпераций" 

	Дано Я открываю основную форму списка справочника "ПрофилиКлючевыхОпераций"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиКлючевыхОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПрофилиКлючевыхОпераций"

	Дано Я открываю основную форму справочника "ПрофилиКлючевыхОпераций"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиКлючевыхОпераций"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РассылкиОтчетов" 

	Дано Я открываю основную форму списка справочника "РассылкиОтчетов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "РассылкиОтчетов"

	Дано Я открываю основную форму справочника "РассылкиОтчетов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкиОтчетов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "РолиИсполнителей" 

	Дано Я открываю основную форму списка справочника "РолиИсполнителей"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника РолиИсполнителей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "РолиИсполнителей"

	Дано Я открываю основную форму справочника "РолиИсполнителей"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника РолиИсполнителей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СертификатыКлючейЭлектроннойПодписиИШифрования" 

	Дано Я открываю основную форму списка справочника "СертификатыКлючейЭлектроннойПодписиИШифрования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыКлючейЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СертификатыКлючейЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму справочника "СертификатыКлючейЭлектроннойПодписиИШифрования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыКлючейЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщениеSMSПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СообщениеSMSПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеSMSПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СообщениеSMSПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СообщениеSMSПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеSMSПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияОбластейДанных" 

	Дано Я открываю основную форму списка справочника "СообщенияОбластейДанных"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СообщенияОбластейДанных"

	Дано Я открываю основную форму справочника "СообщенияОбластейДанных"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияОбластейДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияСистемы" 

	Дано Я открываю основную форму списка справочника "СообщенияСистемы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СообщенияСистемы"

	Дано Я открываю основную форму справочника "СообщенияСистемы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияСистемы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтраныМира" 

	Дано Я открываю основную форму списка справочника "СтраныМира"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СтраныМира"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СтраныМира"

	Дано Я открываю основную форму справочника "СтраныМира"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СтраныМира"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СтроковыеКонтактыВзаимодействий" 

	Дано Я открываю основную форму списка справочника "СтроковыеКонтактыВзаимодействий"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СтроковыеКонтактыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СтроковыеКонтактыВзаимодействий"

	Дано Я открываю основную форму справочника "СтроковыеКонтактыВзаимодействий"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СтроковыеКонтактыВзаимодействий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СценарииОбменовДанными" 

	Дано Я открываю основную форму списка справочника "СценарииОбменовДанными"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СценарииОбменовДанными"

	Дано Я открываю основную форму справочника "СценарииОбменовДанными"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииОбменовДанными"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТелефонныйЗвонокПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТелефонныйЗвонокПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ТелефонныйЗвонокПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ТелефонныйЗвонокПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТелефонныйЗвонокПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ТелефонныйЗвонокПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ТомаХраненияФайлов" 

	Дано Я открываю основную форму списка справочника "ТомаХраненияФайлов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ТомаХраненияФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ТомаХраненияФайлов"

	Дано Я открываю основную форму справочника "ТомаХраненияФайлов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ТомаХраненияФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиСинхронизацииФайлов" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиСинхронизацииФайлов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиСинхронизацииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УчетныеЗаписиСинхронизацииФайлов"

	Дано Я открываю основную форму справочника "УчетныеЗаписиСинхронизацииФайлов"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиСинхронизацииФайлов"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "УчетныеЗаписиЭлектроннойПочты" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиЭлектроннойПочты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УчетныеЗаписиЭлектроннойПочты"

	Дано Я открываю основную форму справочника "УчетныеЗаписиЭлектроннойПочты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиЭлектроннойПочты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "Файлы" 

	Дано Я открываю основную форму списка справочника "Файлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "Файлы"

	Дано Я открываю основную форму справочника "Файлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныАнкет" 

	Дано Я открываю основную форму списка справочника "ШаблоныАнкет"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ШаблоныАнкет"

	Дано Я открываю основную форму справочника "ШаблоныАнкет"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныАнкет"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныЗаданийОчереди" 

	Дано Я открываю основную форму списка справочника "ШаблоныЗаданийОчереди"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЗаданийОчереди"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ШаблоныЗаданийОчереди"

	Дано Я открываю основную форму справочника "ШаблоныЗаданийОчереди"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЗаданийОчереди"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныСообщений" 

	Дано Я открываю основную форму списка справочника "ШаблоныСообщений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ШаблоныСообщений"

	Дано Я открываю основную форму справочника "ШаблоныСообщений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ШаблоныСообщенийПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ШаблоныСообщенийПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщенийПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ШаблоныСообщенийПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ШаблоныСообщенийПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщенийПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Подразделения" 

	Дано Я открываю основную форму списка справочника "СД_Подразделения"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Подразделения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Подразделения"

	Дано Я открываю основную форму справочника "СД_Подразделения"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Подразделения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Территории" 

	Дано Я открываю основную форму списка справочника "СД_Территории"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Территории"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Территории"

	Дано Я открываю основную форму справочника "СД_Территории"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Территории"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ОбъектыОбслуживания" 

	Дано Я открываю основную форму списка справочника "СД_ОбъектыОбслуживания"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОбъектыОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОбъектыОбслуживания"

	Дано Я открываю основную форму справочника "СД_ОбъектыОбслуживания"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОбъектыОбслуживания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Геозоны" 

	Дано Я открываю основную форму списка справочника "СД_Геозоны"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Геозоны"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Геозоны"

	Дано Я открываю основную форму справочника "СД_Геозоны"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Геозоны"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Компетенции" 

	Дано Я открываю основную форму списка справочника "СД_Компетенции"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Компетенции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Компетенции"

	Дано Я открываю основную форму справочника "СД_Компетенции"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Компетенции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ВидыРабот" 

	Дано Я открываю основную форму списка справочника "СД_ВидыРабот"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВидыРабот"

	Дано Я открываю основную форму справочника "СД_ВидыРабот"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Участки" 

	Дано Я открываю основную форму списка справочника "СД_Участки"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Участки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Участки"

	Дано Я открываю основную форму справочника "СД_Участки"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Участки"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Операции" 

	Дано Я открываю основную форму списка справочника "СД_Операции"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Операции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Операции"

	Дано Я открываю основную форму справочника "СД_Операции"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Операции"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Сотрудники" 

	Дано Я открываю основную форму списка справочника "СД_Сотрудники"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Сотрудники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Сотрудники"

	Дано Я открываю основную форму справочника "СД_Сотрудники"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Сотрудники"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Абоненты" 

	Дано Я открываю основную форму списка справочника "СД_Абоненты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Абоненты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Абоненты"

	Дано Я открываю основную форму справочника "СД_Абоненты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Абоненты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ВДГО" 

	Дано Я открываю основную форму списка справочника "СД_ВДГО"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВДГО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВДГО"

	Дано Я открываю основную форму справочника "СД_ВДГО"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВДГО"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ОПП" 

	Дано Я открываю основную форму списка справочника "СД_ОПП"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОПП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОПП"

	Дано Я открываю основную форму справочника "СД_ОПП"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОПП"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ЛС" 

	Дано Я открываю основную форму списка справочника "СД_ЛС"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЛС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЛС"

	Дано Я открываю основную форму справочника "СД_ЛС"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЛС"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Прейскуранты" 

	Дано Я открываю основную форму списка справочника "СД_Прейскуранты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Прейскуранты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Прейскуранты"

	Дано Я открываю основную форму справочника "СД_Прейскуранты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Прейскуранты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ТНПА" 

	Дано Я открываю основную форму списка справочника "СД_ТНПА"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТНПА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ТНПА"

	Дано Я открываю основную форму справочника "СД_ТНПА"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТНПА"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_СервисныеЦентры" 

	Дано Я открываю основную форму списка справочника "СД_СервисныеЦентры"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СервисныеЦентры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СервисныеЦентры"

	Дано Я открываю основную форму справочника "СД_СервисныеЦентры"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СервисныеЦентры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ПоказанияСчетчикаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_ПоказанияСчетчикаПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПоказанияСчетчикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПоказанияСчетчикаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_ПоказанияСчетчикаПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПоказанияСчетчикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ТНПАПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_ТНПАПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТНПАПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ТНПАПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_ТНПАПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТНПАПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Терминалы" 

	Дано Я открываю основную форму списка справочника "СД_Терминалы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Терминалы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Терминалы"

	Дано Я открываю основную форму справочника "СД_Терминалы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Терминалы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ОперацияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_ОперацияПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОперацияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОперацияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_ОперацияПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОперацияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ХранимыеФайлы" 

	Дано Я открываю основную форму списка справочника "ХранимыеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ХранимыеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ХранимыеФайлы"

	Дано Я открываю основную форму справочника "ХранимыеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ХранимыеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_НазначениеПринятыхДанных" 

	Дано Я открываю основную форму списка справочника "СД_НазначениеПринятыхДанных"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НазначениеПринятыхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_НазначениеПринятыхДанных"

	Дано Я открываю основную форму справочника "СД_НазначениеПринятыхДанных"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НазначениеПринятыхДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_КлассификаторОборудования" 

	Дано Я открываю основную форму списка справочника "СД_КлассификаторОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КлассификаторОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_КлассификаторОборудования"

	Дано Я открываю основную форму справочника "СД_КлассификаторОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КлассификаторОборудования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Оборудование" 

	Дано Я открываю основную форму списка справочника "СД_Оборудование"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Оборудование"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Оборудование"

	Дано Я открываю основную форму справочника "СД_Оборудование"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Оборудование"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Инструктаж" 

	Дано Я открываю основную форму списка справочника "СД_Инструктаж"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Инструктаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Инструктаж"

	Дано Я открываю основную форму справочника "СД_Инструктаж"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Инструктаж"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ИконкиКарты" 

	Дано Я открываю основную форму списка справочника "СД_ИконкиКарты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИконкиКарты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ИконкиКарты"

	Дано Я открываю основную форму справочника "СД_ИконкиКарты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИконкиКарты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ИнфраструктураПредприятия" 

	Дано Я открываю основную форму списка справочника "СД_ИнфраструктураПредприятия"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИнфраструктураПредприятия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ИнфраструктураПредприятия"

	Дано Я открываю основную форму справочника "СД_ИнфраструктураПредприятия"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИнфраструктураПредприятия"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Должности" 

	Дано Я открываю основную форму списка справочника "СД_Должности"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Должности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Должности"

	Дано Я открываю основную форму справочника "СД_Должности"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Должности"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Организации" 

	Дано Я открываю основную форму списка справочника "СД_Организации"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Организации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Организации"

	Дано Я открываю основную форму справочника "СД_Организации"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Организации"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ФизическиеЛица" 

	Дано Я открываю основную форму списка справочника "СД_ФизическиеЛица"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ФизическиеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ФизическиеЛица"

	Дано Я открываю основную форму справочника "СД_ФизическиеЛица"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ФизическиеЛица"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_НациональностиФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "СД_НациональностиФизическихЛиц"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НациональностиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_НациональностиФизическихЛиц"

	Дано Я открываю основную форму справочника "СД_НациональностиФизическихЛиц"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НациональностиФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ВидыДокументовФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "СД_ВидыДокументовФизическихЛиц"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыДокументовФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВидыДокументовФизическихЛиц"

	Дано Я открываю основную форму справочника "СД_ВидыДокументовФизическихЛиц"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыДокументовФизическихЛиц"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Цвета" 

	Дано Я открываю основную форму списка справочника "СД_Цвета"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Цвета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Цвета"

	Дано Я открываю основную форму справочника "СД_Цвета"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Цвета"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ВидыОборудования" 

	Дано Я открываю основную форму списка справочника "СД_ВидыОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВидыОборудования"

	Дано Я открываю основную форму справочника "СД_ВидыОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыОборудования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ПричиныОтклоненияЗадач" 

	Дано Я открываю основную форму списка справочника "СД_ПричиныОтклоненияЗадач"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПричиныОтклоненияЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПричиныОтклоненияЗадач"

	Дано Я открываю основную форму справочника "СД_ПричиныОтклоненияЗадач"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПричиныОтклоненияЗадач"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Номенклатура" 

	Дано Я открываю основную форму списка справочника "СД_Номенклатура"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Номенклатура"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Номенклатура"

	Дано Я открываю основную форму справочника "СД_Номенклатура"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Номенклатура"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_СобытияPushУведомлений" 

	Дано Я открываю основную форму списка справочника "СД_СобытияPushУведомлений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СобытияPushУведомлений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СобытияPushУведомлений"

	Дано Я открываю основную форму справочника "СД_СобытияPushУведомлений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СобытияPushУведомлений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_НомераДляСообщенийSMS" 

	Дано Я открываю основную форму списка справочника "СД_НомераДляСообщенийSMS"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НомераДляСообщенийSMS"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_НомераДляСообщенийSMS"

	Дано Я открываю основную форму справочника "СД_НомераДляСообщенийSMS"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НомераДляСообщенийSMS"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_СотрудникиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_СотрудникиПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СотрудникиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СотрудникиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_СотрудникиПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СотрудникиПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_АбонентыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_АбонентыПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_АбонентыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_АбонентыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_АбонентыПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_АбонентыПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ГрафикиРаботы" 

	Дано Я открываю основную форму списка справочника "СД_ГрафикиРаботы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ГрафикиРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ГрафикиРаботы"

	Дано Я открываю основную форму справочника "СД_ГрафикиРаботы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ГрафикиРаботы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ПроизводителиОборудования" 

	Дано Я открываю основную форму списка справочника "СД_ПроизводителиОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПроизводителиОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПроизводителиОборудования"

	Дано Я открываю основную форму справочника "СД_ПроизводителиОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПроизводителиОборудования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_МаркиОборудования" 

	Дано Я открываю основную форму списка справочника "СД_МаркиОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_МаркиОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_МаркиОборудования"

	Дано Я открываю основную форму справочника "СД_МаркиОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_МаркиОборудования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_МоделиОборудования" 

	Дано Я открываю основную форму списка справочника "СД_МоделиОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_МоделиОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_МоделиОборудования"

	Дано Я открываю основную форму справочника "СД_МоделиОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_МоделиОборудования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ШаблоныЗаполненияГрафиковРабочегоВремени" 

	Дано Я открываю основную форму списка справочника "СД_ШаблоныЗаполненияГрафиковРабочегоВремени"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ШаблоныЗаполненияГрафиковРабочегоВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ШаблоныЗаполненияГрафиковРабочегоВремени"

	Дано Я открываю основную форму справочника "СД_ШаблоныЗаполненияГрафиковРабочегоВремени"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ШаблоныЗаполненияГрафиковРабочегоВремени"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Подпись" 

	Дано Я открываю основную форму списка справочника "СД_Подпись"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Подпись"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Подпись"

	Дано Я открываю основную форму справочника "СД_Подпись"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Подпись"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ОбъектыОбслуживанияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_ОбъектыОбслуживанияПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОбъектыОбслуживанияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОбъектыОбслуживанияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_ОбъектыОбслуживанияПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОбъектыОбслуживанияПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Техпаспорта" 

	Дано Я открываю основную форму списка справочника "СД_Техпаспорта"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Техпаспорта"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Техпаспорта"

	Дано Я открываю основную форму справочника "СД_Техпаспорта"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Техпаспорта"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ДоговорыПотребителей" 

	Дано Я открываю основную форму списка справочника "СД_ДоговорыПотребителей"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ДоговорыПотребителей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ДоговорыПотребителей"

	Дано Я открываю основную форму справочника "СД_ДоговорыПотребителей"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ДоговорыПотребителей"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ЗапросыНаИзменениеДанных" 

	Дано Я открываю основную форму списка справочника "СД_ЗапросыНаИзменениеДанных"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗапросыНаИзменениеДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЗапросыНаИзменениеДанных"

	Дано Я открываю основную форму справочника "СД_ЗапросыНаИзменениеДанных"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗапросыНаИзменениеДанных"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ЗапросыНаИзменениеДанныхПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_ЗапросыНаИзменениеДанныхПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗапросыНаИзменениеДанныхПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЗапросыНаИзменениеДанныхПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_ЗапросыНаИзменениеДанныхПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗапросыНаИзменениеДанныхПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ЗагрузкиПлановОбслуживания" 

	Дано Я открываю основную форму списка справочника "СД_ЗагрузкиПлановОбслуживания"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗагрузкиПлановОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЗагрузкиПлановОбслуживания"

	Дано Я открываю основную форму справочника "СД_ЗагрузкиПлановОбслуживания"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗагрузкиПлановОбслуживания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "ОчередиСообщенийИнтегрированныхСистем" 

	Дано Я открываю основную форму списка справочника "ОчередиСообщенийИнтегрированныхСистем"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередиСообщенийИнтегрированныхСистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОчередиСообщенийИнтегрированныхСистем"

	Дано Я открываю основную форму справочника "ОчередиСообщенийИнтегрированныхСистем"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередиСообщенийИнтегрированныхСистем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СообщенияИнтегрированныхСистем" 

	Дано Я открываю основную форму списка справочника "СообщенияИнтегрированныхСистем"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияИнтегрированныхСистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СообщенияИнтегрированныхСистем"

	Дано Я открываю основную форму справочника "СообщенияИнтегрированныхСистем"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияИнтегрированныхСистем"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ТипыСовместимостиВидовРабот" 

	Дано Я открываю основную форму списка справочника "СД_ТипыСовместимостиВидовРабот"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТипыСовместимостиВидовРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ТипыСовместимостиВидовРабот"

	Дано Я открываю основную форму справочника "СД_ТипыСовместимостиВидовРабот"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТипыСовместимостиВидовРабот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ВидыЗамечаний" 

	Дано Я открываю основную форму списка справочника "СД_ВидыЗамечаний"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыЗамечаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВидыЗамечаний"

	Дано Я открываю основную форму справочника "СД_ВидыЗамечаний"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыЗамечаний"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ВидыСооружений" 

	Дано Я открываю основную форму списка справочника "СД_ВидыСооружений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыСооружений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВидыСооружений"

	Дано Я открываю основную форму справочника "СД_ВидыСооружений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыСооружений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ЗамечаниеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_ЗамечаниеПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗамечаниеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЗамечаниеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_ЗамечаниеПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗамечаниеПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ШаблоныСообщений" 

	Дано Я открываю основную форму списка справочника "СД_ШаблоныСообщений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ШаблоныСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ШаблоныСообщений"

	Дано Я открываю основную форму справочника "СД_ШаблоныСообщений"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ШаблоныСообщений"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ТипыЗамечаний" 

	Дано Я открываю основную форму списка справочника "СД_ТипыЗамечаний"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТипыЗамечаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ТипыЗамечаний"

	Дано Я открываю основную форму справочника "СД_ТипыЗамечаний"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТипыЗамечаний"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Маршруты" 

	Дано Я открываю основную форму списка справочника "СД_Маршруты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Маршруты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Маршруты"

	Дано Я открываю основную форму справочника "СД_Маршруты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Маршруты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_СправкаМУ" 

	Дано Я открываю основную форму списка справочника "СД_СправкаМУ"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СправкаМУ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СправкаМУ"

	Дано Я открываю основную форму справочника "СД_СправкаМУ"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СправкаМУ"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_КатегорииЛьгот" 

	Дано Я открываю основную форму списка справочника "СД_КатегорииЛьгот"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КатегорииЛьгот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_КатегорииЛьгот"

	Дано Я открываю основную форму справочника "СД_КатегорииЛьгот"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КатегорииЛьгот"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ПараметрыОбъектовОбслуживания" 

	Дано Я открываю основную форму списка справочника "СД_ПараметрыОбъектовОбслуживания"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПараметрыОбъектовОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПараметрыОбъектовОбслуживания"

	Дано Я открываю основную форму справочника "СД_ПараметрыОбъектовОбслуживания"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПараметрыОбъектовОбслуживания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ПаспортаОбъектовОбслуживания" 

	Дано Я открываю основную форму списка справочника "СД_ПаспортаОбъектовОбслуживания"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПаспортаОбъектовОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПаспортаОбъектовОбслуживания"

	Дано Я открываю основную форму справочника "СД_ПаспортаОбъектовОбслуживания"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПаспортаОбъектовОбслуживания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ПривязкиПодразделенийКБазам" 

	Дано Я открываю основную форму списка справочника "СД_ПривязкиПодразделенийКБазам"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПривязкиПодразделенийКБазам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПривязкиПодразделенийКБазам"

	Дано Я открываю основную форму справочника "СД_ПривязкиПодразделенийКБазам"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПривязкиПодразделенийКБазам"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_МобильныеПриложения" 

	Дано Я открываю основную форму списка справочника "СД_МобильныеПриложения"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_МобильныеПриложения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_МобильныеПриложения"

	Дано Я открываю основную форму справочника "СД_МобильныеПриложения"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_МобильныеПриложения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Контрагенты" 

	Дано Я открываю основную форму списка справочника "СД_Контрагенты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Контрагенты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Контрагенты"

	Дано Я открываю основную форму справочника "СД_Контрагенты"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Контрагенты"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ГруппыНоменклатуры" 

	Дано Я открываю основную форму списка справочника "СД_ГруппыНоменклатуры"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ГруппыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ГруппыНоменклатуры"

	Дано Я открываю основную форму справочника "СД_ГруппыНоменклатуры"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ГруппыНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ПричиныОтменыЧека" 

	Дано Я открываю основную форму списка справочника "СД_ПричиныОтменыЧека"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПричиныОтменыЧека"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПричиныОтменыЧека"

	Дано Я открываю основную форму справочника "СД_ПричиныОтменыЧека"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПричиныОтменыЧека"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_КатегорииОбъектовОбслуживания" 

	Дано Я открываю основную форму списка справочника "СД_КатегорииОбъектовОбслуживания"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КатегорииОбъектовОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_КатегорииОбъектовОбслуживания"

	Дано Я открываю основную форму справочника "СД_КатегорииОбъектовОбслуживания"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КатегорииОбъектовОбслуживания"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_КлассификаторЕдиницИзмерения" 

	Дано Я открываю основную форму списка справочника "СД_КлассификаторЕдиницИзмерения"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КлассификаторЕдиницИзмерения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_КлассификаторЕдиницИзмерения"

	Дано Я открываю основную форму справочника "СД_КлассификаторЕдиницИзмерения"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КлассификаторЕдиницИзмерения"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ИзменениеОборудования" 

	Дано Я открываю основную форму списка справочника "СД_ИзменениеОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИзменениеОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ИзменениеОборудования"

	Дано Я открываю основную форму справочника "СД_ИзменениеОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИзменениеОборудования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ИзменениеКлассификаторОборудования" 

	Дано Я открываю основную форму списка справочника "СД_ИзменениеКлассификаторОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИзменениеКлассификаторОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ИзменениеКлассификаторОборудования"

	Дано Я открываю основную форму справочника "СД_ИзменениеКлассификаторОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИзменениеКлассификаторОборудования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ОснованияОтключенияОборудования" 

	Дано Я открываю основную форму списка справочника "СД_ОснованияОтключенияОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОснованияОтключенияОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОснованияОтключенияОборудования"

	Дано Я открываю основную форму справочника "СД_ОснованияОтключенияОборудования"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОснованияОтключенияОборудования"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ВидыНоменклатуры" 

	Дано Я открываю основную форму списка справочника "СД_ВидыНоменклатуры"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВидыНоменклатуры"

	Дано Я открываю основную форму справочника "СД_ВидыНоменклатуры"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыНоменклатуры"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_НоменклатураПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_НоменклатураПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НоменклатураПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_НоменклатураПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_НоменклатураПрисоединенныеФайлы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НоменклатураПрисоединенныеФайлы"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_ГруппыТерриторий" 

	Дано Я открываю основную форму списка справочника "СД_ГруппыТерриторий"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ГруппыТерриторий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ГруппыТерриторий"

	Дано Я открываю основную форму справочника "СД_ГруппыТерриторий"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ГруппыТерриторий"
	И Я закрываю текущее окно

	
Сценарий: Открытие формы списка "СД_Алгоритмы" 

	Дано Я открываю основную форму списка справочника "СД_Алгоритмы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Алгоритмы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Алгоритмы"

	Дано Я открываю основную форму справочника "СД_Алгоритмы"
	//Если появилось предупреждение тогда
		//Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Алгоритмы"
	И Я закрываю текущее окно

