
#language: ru

@tree

Функциональность: Дымовые тесты

Контекст:
	И я подключаю TestClient "sd_test" логин "Руководитель1" пароль ""
	
Сценарий: Открытие формы списка "Валюты" 

	Дано Я открываю основную форму списка справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "Валюты"

	Дано Я открываю основную форму справочника "Валюты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Валюты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ВариантыОтветовАнкет" 

	Дано Я открываю основную форму списка справочника "ВариантыОтветовАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтветовАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВариантыОтветовАнкет"

	Дано Я открываю основную форму справочника "ВариантыОтветовАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтветовАнкет"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ВариантыОтчетов" 

	Дано Я открываю основную форму списка справочника "ВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВариантыОтчетов"

	Дано Я открываю основную форму справочника "ВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВариантыОтчетов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ВерсииРасширений" 

	Дано Я открываю основную форму списка справочника "ВерсииРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВерсииРасширений"

	Дано Я открываю основную форму справочника "ВерсииРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииРасширений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ВерсииФайлов" 

	Дано Я открываю основную форму списка справочника "ВерсииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВерсииФайлов"

	Дано Я открываю основную форму справочника "ВерсииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВерсииФайлов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ВидыКонтактнойИнформации" 

	Дано Я открываю основную форму списка справочника "ВидыКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКонтактнойИнформации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВидыКонтактнойИнформации"

	Дано Я открываю основную форму справочника "ВидыКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыКонтактнойИнформации"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ВидыПроверок" 

	Дано Я открываю основную форму списка справочника "ВидыПроверок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПроверок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВидыПроверок"

	Дано Я открываю основную форму справочника "ВидыПроверок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВидыПроверок"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ВнешниеКомпоненты" 

	Дано Я открываю основную форму списка справочника "ВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеКомпоненты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВнешниеКомпоненты"

	Дано Я открываю основную форму справочника "ВнешниеКомпоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеКомпоненты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ВнешниеПользователи" 

	Дано Я открываю основную форму списка справочника "ВнешниеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеПользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВнешниеПользователи"

	Дано Я открываю основную форму справочника "ВнешниеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВнешниеПользователи"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ВопросыШаблонаАнкеты" 

	Дано Я открываю основную форму списка справочника "ВопросыШаблонаАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВопросыШаблонаАнкеты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВопросыШаблонаАнкеты"

	Дано Я открываю основную форму справочника "ВопросыШаблонаАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВопросыШаблонаАнкеты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ВстречаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ВстречаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВстречаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВстречаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ВстречаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ВстречаПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ГруппыВнешнихПользователей" 

	Дано Я открываю основную форму списка справочника "ГруппыВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыВнешнихПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ГруппыВнешнихПользователей"

	Дано Я открываю основную форму справочника "ГруппыВнешнихПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыВнешнихПользователей"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ГруппыДоступа" 

	Дано Я открываю основную форму списка справочника "ГруппыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ГруппыДоступа"

	Дано Я открываю основную форму справочника "ГруппыДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыДоступа"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ГруппыИсполнителейЗадач" 

	Дано Я открываю основную форму списка справочника "ГруппыИсполнителейЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыИсполнителейЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ГруппыИсполнителейЗадач"

	Дано Я открываю основную форму справочника "ГруппыИсполнителейЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыИсполнителейЗадач"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ГруппыПользователей" 

	Дано Я открываю основную форму списка справочника "ГруппыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ГруппыПользователей"

	Дано Я открываю основную форму справочника "ГруппыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ГруппыПользователей"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ДополнительныеОтчетыИОбработки" 

	Дано Я открываю основную форму списка справочника "ДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ДополнительныеОтчетыИОбработки"

	Дано Я открываю основную форму справочника "ДополнительныеОтчетыИОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ДополнительныеОтчетыИОбработки"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗакладкиВзаимодействий" 

	Дано Я открываю основную форму списка справочника "ЗакладкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗакладкиВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗакладкиВзаимодействий"

	Дано Я открываю основную форму справочника "ЗакладкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗакладкиВзаимодействий"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "Заметки" 

	Дано Я открываю основную форму списка справочника "Заметки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Заметки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "Заметки"

	Дано Я открываю основную форму справочника "Заметки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Заметки"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗапланированноеВзаимодействиеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗапланированноеВзаимодействиеПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗначенияСвойствОбъектов" 

	Дано Я открываю основную форму списка справочника "ЗначенияСвойствОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗначенияСвойствОбъектов"

	Дано Я открываю основную форму справочника "ЗначенияСвойствОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗначенияСвойствОбъектовИерархия" 

	Дано Я открываю основную форму списка справочника "ЗначенияСвойствОбъектовИерархия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектовИерархия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗначенияСвойствОбъектовИерархия"

	Дано Я открываю основную форму справочника "ЗначенияСвойствОбъектовИерархия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЗначенияСвойствОбъектовИерархия"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовМетаданных" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыОбъектовМетаданных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовМетаданных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ИдентификаторыОбъектовМетаданных"

	Дано Я открываю основную форму справочника "ИдентификаторыОбъектовМетаданных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовМетаданных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовРасширений" 

	Дано Я открываю основную форму списка справочника "ИдентификаторыОбъектовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ИдентификаторыОбъектовРасширений"

	Дано Я открываю основную форму справочника "ИдентификаторыОбъектовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ИдентификаторыОбъектовРасширений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "Календари" 

	Дано Я открываю основную форму списка справочника "Календари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Календари"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "Календари"

	Дано Я открываю основную форму справочника "Календари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Календари"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "КлассификаторБанков" 

	Дано Я открываю основную форму списка справочника "КлассификаторБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторБанков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "КлассификаторБанков"

	Дано Я открываю основную форму справочника "КлассификаторБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлассификаторБанков"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "КлючевыеОперации" 

	Дано Я открываю основную форму списка справочника "КлючевыеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючевыеОперации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "КлючевыеОперации"

	Дано Я открываю основную форму справочника "КлючевыеОперации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника КлючевыеОперации"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НаборыДополнительныхРеквизитовИСведений" 

	Дано Я открываю основную форму списка справочника "НаборыДополнительныхРеквизитовИСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыДополнительныхРеквизитовИСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НаборыДополнительныхРеквизитовИСведений"

	Дано Я открываю основную форму справочника "НаборыДополнительныхРеквизитовИСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника НаборыДополнительныхРеквизитовИСведений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ОчередьЗаданий" 

	Дано Я открываю основную форму списка справочника "ОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОчередьЗаданий"

	Дано Я открываю основную форму справочника "ОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданий"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ОчередьЗаданийОбластейДанных" 

	Дано Я открываю основную форму списка справочника "ОчередьЗаданийОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданийОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОчередьЗаданийОбластейДанных"

	Дано Я открываю основную форму справочника "ОчередьЗаданийОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередьЗаданийОбластейДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПапкиФайлов" 

	Дано Я открываю основную форму списка справочника "ПапкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПапкиФайлов"

	Дано Я открываю основную форму справочника "ПапкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиФайлов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПапкиЭлектронныхПисем" 

	Дано Я открываю основную форму списка справочника "ПапкиЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиЭлектронныхПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПапкиЭлектронныхПисем"

	Дано Я открываю основную форму справочника "ПапкиЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПапкиЭлектронныхПисем"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "Пользователи" 

	Дано Я открываю основную форму списка справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "Пользователи"

	Дано Я открываю основную форму справочника "Пользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Пользователи"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПользовательскиеНастройкиОтчетов" 

	Дано Я открываю основную форму списка справочника "ПользовательскиеНастройкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользовательскиеНастройкиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПользовательскиеНастройкиОтчетов"

	Дано Я открываю основную форму справочника "ПользовательскиеНастройкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПользовательскиеНастройкиОтчетов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПоставляемыеДанные" 

	Дано Я открываю основную форму списка справочника "ПоставляемыеДанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДанные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПоставляемыеДанные"

	Дано Я открываю основную форму справочника "ПоставляемыеДанные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПоставляемыеДанные"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПравилаОбработкиЭлектроннойПочты" 

	Дано Я открываю основную форму списка справочника "ПравилаОбработкиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбработкиЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПравилаОбработкиЭлектроннойПочты"

	Дано Я открываю основную форму справочника "ПравилаОбработкиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаОбработкиЭлектроннойПочты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПравилаПроверкиУчета" 

	Дано Я открываю основную форму списка справочника "ПравилаПроверкиУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаПроверкиУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПравилаПроверкиУчета"

	Дано Я открываю основную форму справочника "ПравилаПроверкиУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПравилаПроверкиУчета"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетов" 

	Дано Я открываю основную форму списка справочника "ПредопределенныеВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПредопределенныеВариантыОтчетов"

	Дано Я открываю основную форму справочника "ПредопределенныеВариантыОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетовРасширений" 

	Дано Я открываю основную форму списка справочника "ПредопределенныеВариантыОтчетовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетовРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПредопределенныеВариантыОтчетовРасширений"

	Дано Я открываю основную форму справочника "ПредопределенныеВариантыОтчетовРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПредопределенныеВариантыОтчетовРасширений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПрограммыЭлектроннойПодписиИШифрования" 

	Дано Я открываю основную форму списка справочника "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПрограммыЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму справочника "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПроизводственныеКалендари" 

	Дано Я открываю основную форму списка справочника "ПроизводственныеКалендари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеКалендари"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПроизводственныеКалендари"

	Дано Я открываю основную форму справочника "ПроизводственныеКалендари"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПроизводственныеКалендари"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПрофилиГруппДоступа" 

	Дано Я открываю основную форму списка справочника "ПрофилиГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПрофилиГруппДоступа"

	Дано Я открываю основную форму справочника "ПрофилиГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиГруппДоступа"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПрофилиКлючевыхОпераций" 

	Дано Я открываю основную форму списка справочника "ПрофилиКлючевыхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиКлючевыхОпераций"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПрофилиКлючевыхОпераций"

	Дано Я открываю основную форму справочника "ПрофилиКлючевыхОпераций"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ПрофилиКлючевыхОпераций"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "РассылкиОтчетов" 

	Дано Я открываю основную форму списка справочника "РассылкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкиОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "РассылкиОтчетов"

	Дано Я открываю основную форму справочника "РассылкиОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РассылкиОтчетов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "РолиИсполнителей" 

	Дано Я открываю основную форму списка справочника "РолиИсполнителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиИсполнителей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "РолиИсполнителей"

	Дано Я открываю основную форму справочника "РолиИсполнителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника РолиИсполнителей"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СертификатыКлючейЭлектроннойПодписиИШифрования" 

	Дано Я открываю основную форму списка справочника "СертификатыКлючейЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыКлючейЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СертификатыКлючейЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму справочника "СертификатыКлючейЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СертификатыКлючейЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СообщениеSMSПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СообщениеSMSПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеSMSПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СообщениеSMSПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СообщениеSMSПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщениеSMSПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СообщенияОбластейДанных" 

	Дано Я открываю основную форму списка справочника "СообщенияОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СообщенияОбластейДанных"

	Дано Я открываю основную форму справочника "СообщенияОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияОбластейДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СообщенияСистемы" 

	Дано Я открываю основную форму списка справочника "СообщенияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияСистемы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СообщенияСистемы"

	Дано Я открываю основную форму справочника "СообщенияСистемы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияСистемы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СтраныМира" 

	Дано Я открываю основную форму списка справочника "СтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтраныМира"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СтраныМира"

	Дано Я открываю основную форму справочника "СтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтраныМира"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СтроковыеКонтактыВзаимодействий" 

	Дано Я открываю основную форму списка справочника "СтроковыеКонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтроковыеКонтактыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СтроковыеКонтактыВзаимодействий"

	Дано Я открываю основную форму справочника "СтроковыеКонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СтроковыеКонтактыВзаимодействий"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СценарииОбменовДанными" 

	Дано Я открываю основную форму списка справочника "СценарииОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СценарииОбменовДанными"

	Дано Я открываю основную форму справочника "СценарииОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СценарииОбменовДанными"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ТелефонныйЗвонокПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ТелефонныйЗвонокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелефонныйЗвонокПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ТелефонныйЗвонокПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ТелефонныйЗвонокПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТелефонныйЗвонокПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ТомаХраненияФайлов" 

	Дано Я открываю основную форму списка справочника "ТомаХраненияФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТомаХраненияФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ТомаХраненияФайлов"

	Дано Я открываю основную форму справочника "ТомаХраненияФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ТомаХраненияФайлов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УчетныеЗаписиСинхронизацииФайлов" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиСинхронизацииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УчетныеЗаписиСинхронизацииФайлов"

	Дано Я открываю основную форму справочника "УчетныеЗаписиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиСинхронизацииФайлов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УчетныеЗаписиЭлектроннойПочты" 

	Дано Я открываю основную форму списка справочника "УчетныеЗаписиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УчетныеЗаписиЭлектроннойПочты"

	Дано Я открываю основную форму справочника "УчетныеЗаписиЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника УчетныеЗаписиЭлектроннойПочты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "Файлы" 

	Дано Я открываю основную форму списка справочника "Файлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "Файлы"

	Дано Я открываю основную форму справочника "Файлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника Файлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ШаблоныАнкет" 

	Дано Я открываю основную форму списка справочника "ШаблоныАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ШаблоныАнкет"

	Дано Я открываю основную форму справочника "ШаблоныАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныАнкет"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ШаблоныЗаданийОчереди" 

	Дано Я открываю основную форму списка справочника "ШаблоныЗаданийОчереди"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЗаданийОчереди"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ШаблоныЗаданийОчереди"

	Дано Я открываю основную форму справочника "ШаблоныЗаданийОчереди"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныЗаданийОчереди"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ШаблоныСообщений" 

	Дано Я открываю основную форму списка справочника "ШаблоныСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ШаблоныСообщений"

	Дано Я открываю основную форму справочника "ШаблоныСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ШаблоныСообщенийПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ШаблоныСообщенийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщенийПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ШаблоныСообщенийПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ШаблоныСообщенийПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ШаблоныСообщенийПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоВходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ЭлектронноеПисьмоИсходящееПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Подразделения" 

	Дано Я открываю основную форму списка справочника "СД_Подразделения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Подразделения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Подразделения"

	Дано Я открываю основную форму справочника "СД_Подразделения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Подразделения"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Территории" 

	Дано Я открываю основную форму списка справочника "СД_Территории"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Территории"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Территории"

	Дано Я открываю основную форму справочника "СД_Территории"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Территории"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ОбъектыОбслуживания" 

	Дано Я открываю основную форму списка справочника "СД_ОбъектыОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОбъектыОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОбъектыОбслуживания"

	Дано Я открываю основную форму справочника "СД_ОбъектыОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОбъектыОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Геозоны" 

	Дано Я открываю основную форму списка справочника "СД_Геозоны"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Геозоны"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Геозоны"

	Дано Я открываю основную форму справочника "СД_Геозоны"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Геозоны"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Компетенции" 

	Дано Я открываю основную форму списка справочника "СД_Компетенции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Компетенции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Компетенции"

	Дано Я открываю основную форму справочника "СД_Компетенции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Компетенции"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ВидыРабот" 

	Дано Я открываю основную форму списка справочника "СД_ВидыРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВидыРабот"

	Дано Я открываю основную форму справочника "СД_ВидыРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыРабот"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Участки" 

	Дано Я открываю основную форму списка справочника "СД_Участки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Участки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Участки"

	Дано Я открываю основную форму справочника "СД_Участки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Участки"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Операции" 

	Дано Я открываю основную форму списка справочника "СД_Операции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Операции"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Операции"

	Дано Я открываю основную форму справочника "СД_Операции"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Операции"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Сотрудники" 

	Дано Я открываю основную форму списка справочника "СД_Сотрудники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Сотрудники"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Сотрудники"

	Дано Я открываю основную форму справочника "СД_Сотрудники"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Сотрудники"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Абоненты" 

	Дано Я открываю основную форму списка справочника "СД_Абоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Абоненты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Абоненты"

	Дано Я открываю основную форму справочника "СД_Абоненты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Абоненты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ВДГО" 

	Дано Я открываю основную форму списка справочника "СД_ВДГО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВДГО"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВДГО"

	Дано Я открываю основную форму справочника "СД_ВДГО"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВДГО"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ОПП" 

	Дано Я открываю основную форму списка справочника "СД_ОПП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОПП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОПП"

	Дано Я открываю основную форму справочника "СД_ОПП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОПП"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ЛС" 

	Дано Я открываю основную форму списка справочника "СД_ЛС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЛС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЛС"

	Дано Я открываю основную форму справочника "СД_ЛС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЛС"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Прейскуранты" 

	Дано Я открываю основную форму списка справочника "СД_Прейскуранты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Прейскуранты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Прейскуранты"

	Дано Я открываю основную форму справочника "СД_Прейскуранты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Прейскуранты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ТНПА" 

	Дано Я открываю основную форму списка справочника "СД_ТНПА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТНПА"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ТНПА"

	Дано Я открываю основную форму справочника "СД_ТНПА"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТНПА"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_СервисныеЦентры" 

	Дано Я открываю основную форму списка справочника "СД_СервисныеЦентры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СервисныеЦентры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СервисныеЦентры"

	Дано Я открываю основную форму справочника "СД_СервисныеЦентры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СервисныеЦентры"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПоказанияСчетчикаПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_ПоказанияСчетчикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПоказанияСчетчикаПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПоказанияСчетчикаПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_ПоказанияСчетчикаПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПоказанияСчетчикаПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ТНПАПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_ТНПАПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТНПАПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ТНПАПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_ТНПАПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТНПАПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Терминалы" 

	Дано Я открываю основную форму списка справочника "СД_Терминалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Терминалы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Терминалы"

	Дано Я открываю основную форму справочника "СД_Терминалы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Терминалы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ОперацияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_ОперацияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОперацияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОперацияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_ОперацияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОперацияПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ХранимыеФайлы" 

	Дано Я открываю основную форму списка справочника "ХранимыеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХранимыеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ХранимыеФайлы"

	Дано Я открываю основную форму справочника "ХранимыеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ХранимыеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_НазначениеПринятыхДанных" 

	Дано Я открываю основную форму списка справочника "СД_НазначениеПринятыхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НазначениеПринятыхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_НазначениеПринятыхДанных"

	Дано Я открываю основную форму справочника "СД_НазначениеПринятыхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НазначениеПринятыхДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_КлассификаторОборудования" 

	Дано Я открываю основную форму списка справочника "СД_КлассификаторОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КлассификаторОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_КлассификаторОборудования"

	Дано Я открываю основную форму справочника "СД_КлассификаторОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КлассификаторОборудования"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Оборудование" 

	Дано Я открываю основную форму списка справочника "СД_Оборудование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Оборудование"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Оборудование"

	Дано Я открываю основную форму справочника "СД_Оборудование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Оборудование"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Инструктаж" 

	Дано Я открываю основную форму списка справочника "СД_Инструктаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Инструктаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Инструктаж"

	Дано Я открываю основную форму справочника "СД_Инструктаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Инструктаж"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ИконкиКарты" 

	Дано Я открываю основную форму списка справочника "СД_ИконкиКарты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИконкиКарты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ИконкиКарты"

	Дано Я открываю основную форму справочника "СД_ИконкиКарты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИконкиКарты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ИнфраструктураПредприятия" 

	Дано Я открываю основную форму списка справочника "СД_ИнфраструктураПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИнфраструктураПредприятия"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ИнфраструктураПредприятия"

	Дано Я открываю основную форму справочника "СД_ИнфраструктураПредприятия"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИнфраструктураПредприятия"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Должности" 

	Дано Я открываю основную форму списка справочника "СД_Должности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Должности"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Должности"

	Дано Я открываю основную форму справочника "СД_Должности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Должности"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Организации" 

	Дано Я открываю основную форму списка справочника "СД_Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Организации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Организации"

	Дано Я открываю основную форму справочника "СД_Организации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Организации"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ФизическиеЛица" 

	Дано Я открываю основную форму списка справочника "СД_ФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ФизическиеЛица"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ФизическиеЛица"

	Дано Я открываю основную форму справочника "СД_ФизическиеЛица"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ФизическиеЛица"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_НациональностиФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "СД_НациональностиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НациональностиФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_НациональностиФизическихЛиц"

	Дано Я открываю основную форму справочника "СД_НациональностиФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НациональностиФизическихЛиц"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ВидыДокументовФизическихЛиц" 

	Дано Я открываю основную форму списка справочника "СД_ВидыДокументовФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыДокументовФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВидыДокументовФизическихЛиц"

	Дано Я открываю основную форму справочника "СД_ВидыДокументовФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыДокументовФизическихЛиц"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Цвета" 

	Дано Я открываю основную форму списка справочника "СД_Цвета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Цвета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Цвета"

	Дано Я открываю основную форму справочника "СД_Цвета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Цвета"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ВидыОборудования" 

	Дано Я открываю основную форму списка справочника "СД_ВидыОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВидыОборудования"

	Дано Я открываю основную форму справочника "СД_ВидыОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыОборудования"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПричиныОтклоненияЗадач" 

	Дано Я открываю основную форму списка справочника "СД_ПричиныОтклоненияЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПричиныОтклоненияЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПричиныОтклоненияЗадач"

	Дано Я открываю основную форму справочника "СД_ПричиныОтклоненияЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПричиныОтклоненияЗадач"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Номенклатура" 

	Дано Я открываю основную форму списка справочника "СД_Номенклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Номенклатура"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Номенклатура"

	Дано Я открываю основную форму справочника "СД_Номенклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Номенклатура"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_СобытияPushУведомлений" 

	Дано Я открываю основную форму списка справочника "СД_СобытияPushУведомлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СобытияPushУведомлений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СобытияPushУведомлений"

	Дано Я открываю основную форму справочника "СД_СобытияPushУведомлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СобытияPushУведомлений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_НомераДляСообщенийSMS" 

	Дано Я открываю основную форму списка справочника "СД_НомераДляСообщенийSMS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НомераДляСообщенийSMS"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_НомераДляСообщенийSMS"

	Дано Я открываю основную форму справочника "СД_НомераДляСообщенийSMS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НомераДляСообщенийSMS"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_СотрудникиПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_СотрудникиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СотрудникиПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СотрудникиПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_СотрудникиПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СотрудникиПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_АбонентыПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_АбонентыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_АбонентыПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_АбонентыПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_АбонентыПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_АбонентыПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ГрафикиРаботы" 

	Дано Я открываю основную форму списка справочника "СД_ГрафикиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ГрафикиРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ГрафикиРаботы"

	Дано Я открываю основную форму справочника "СД_ГрафикиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ГрафикиРаботы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПроизводителиОборудования" 

	Дано Я открываю основную форму списка справочника "СД_ПроизводителиОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПроизводителиОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПроизводителиОборудования"

	Дано Я открываю основную форму справочника "СД_ПроизводителиОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПроизводителиОборудования"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_МаркиОборудования" 

	Дано Я открываю основную форму списка справочника "СД_МаркиОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_МаркиОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_МаркиОборудования"

	Дано Я открываю основную форму справочника "СД_МаркиОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_МаркиОборудования"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_МоделиОборудования" 

	Дано Я открываю основную форму списка справочника "СД_МоделиОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_МоделиОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_МоделиОборудования"

	Дано Я открываю основную форму справочника "СД_МоделиОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_МоделиОборудования"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ШаблоныЗаполненияГрафиковРабочегоВремени" 

	Дано Я открываю основную форму списка справочника "СД_ШаблоныЗаполненияГрафиковРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ШаблоныЗаполненияГрафиковРабочегоВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ШаблоныЗаполненияГрафиковРабочегоВремени"

	Дано Я открываю основную форму справочника "СД_ШаблоныЗаполненияГрафиковРабочегоВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ШаблоныЗаполненияГрафиковРабочегоВремени"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Подпись" 

	Дано Я открываю основную форму списка справочника "СД_Подпись"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Подпись"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Подпись"

	Дано Я открываю основную форму справочника "СД_Подпись"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Подпись"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ОбъектыОбслуживанияПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_ОбъектыОбслуживанияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОбъектыОбслуживанияПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОбъектыОбслуживанияПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_ОбъектыОбслуживанияПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОбъектыОбслуживанияПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Техпаспорта" 

	Дано Я открываю основную форму списка справочника "СД_Техпаспорта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Техпаспорта"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Техпаспорта"

	Дано Я открываю основную форму справочника "СД_Техпаспорта"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Техпаспорта"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ДоговорыПотребителей" 

	Дано Я открываю основную форму списка справочника "СД_ДоговорыПотребителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ДоговорыПотребителей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ДоговорыПотребителей"

	Дано Я открываю основную форму справочника "СД_ДоговорыПотребителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ДоговорыПотребителей"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ЗапросыНаИзменениеДанных" 

	Дано Я открываю основную форму списка справочника "СД_ЗапросыНаИзменениеДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗапросыНаИзменениеДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЗапросыНаИзменениеДанных"

	Дано Я открываю основную форму справочника "СД_ЗапросыНаИзменениеДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗапросыНаИзменениеДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ЗапросыНаИзменениеДанныхПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_ЗапросыНаИзменениеДанныхПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗапросыНаИзменениеДанныхПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЗапросыНаИзменениеДанныхПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_ЗапросыНаИзменениеДанныхПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗапросыНаИзменениеДанныхПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ЗагрузкиПлановОбслуживания" 

	Дано Я открываю основную форму списка справочника "СД_ЗагрузкиПлановОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗагрузкиПлановОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЗагрузкиПлановОбслуживания"

	Дано Я открываю основную форму справочника "СД_ЗагрузкиПлановОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗагрузкиПлановОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ОчередиСообщенийИнтегрированныхСистем" 

	Дано Я открываю основную форму списка справочника "ОчередиСообщенийИнтегрированныхСистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередиСообщенийИнтегрированныхСистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОчередиСообщенийИнтегрированныхСистем"

	Дано Я открываю основную форму справочника "ОчередиСообщенийИнтегрированныхСистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника ОчередиСообщенийИнтегрированныхСистем"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СообщенияИнтегрированныхСистем" 

	Дано Я открываю основную форму списка справочника "СообщенияИнтегрированныхСистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияИнтегрированныхСистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СообщенияИнтегрированныхСистем"

	Дано Я открываю основную форму справочника "СообщенияИнтегрированныхСистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СообщенияИнтегрированныхСистем"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ТипыСовместимостиВидовРабот" 

	Дано Я открываю основную форму списка справочника "СД_ТипыСовместимостиВидовРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТипыСовместимостиВидовРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ТипыСовместимостиВидовРабот"

	Дано Я открываю основную форму справочника "СД_ТипыСовместимостиВидовРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТипыСовместимостиВидовРабот"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ВидыЗамечаний" 

	Дано Я открываю основную форму списка справочника "СД_ВидыЗамечаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыЗамечаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВидыЗамечаний"

	Дано Я открываю основную форму справочника "СД_ВидыЗамечаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыЗамечаний"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ВидыСооружений" 

	Дано Я открываю основную форму списка справочника "СД_ВидыСооружений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыСооружений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВидыСооружений"

	Дано Я открываю основную форму справочника "СД_ВидыСооружений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыСооружений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ЗамечаниеПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_ЗамечаниеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗамечаниеПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЗамечаниеПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_ЗамечаниеПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ЗамечаниеПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ШаблоныСообщений" 

	Дано Я открываю основную форму списка справочника "СД_ШаблоныСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ШаблоныСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ШаблоныСообщений"

	Дано Я открываю основную форму справочника "СД_ШаблоныСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ШаблоныСообщений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ТипыЗамечаний" 

	Дано Я открываю основную форму списка справочника "СД_ТипыЗамечаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТипыЗамечаний"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ТипыЗамечаний"

	Дано Я открываю основную форму справочника "СД_ТипыЗамечаний"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ТипыЗамечаний"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Маршруты" 

	Дано Я открываю основную форму списка справочника "СД_Маршруты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Маршруты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Маршруты"

	Дано Я открываю основную форму справочника "СД_Маршруты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Маршруты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_СправкаМУ" 

	Дано Я открываю основную форму списка справочника "СД_СправкаМУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СправкаМУ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СправкаМУ"

	Дано Я открываю основную форму справочника "СД_СправкаМУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_СправкаМУ"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_КатегорииЛьгот" 

	Дано Я открываю основную форму списка справочника "СД_КатегорииЛьгот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КатегорииЛьгот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_КатегорииЛьгот"

	Дано Я открываю основную форму справочника "СД_КатегорииЛьгот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КатегорииЛьгот"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПараметрыОбъектовОбслуживания" 

	Дано Я открываю основную форму списка справочника "СД_ПараметрыОбъектовОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПараметрыОбъектовОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПараметрыОбъектовОбслуживания"

	Дано Я открываю основную форму справочника "СД_ПараметрыОбъектовОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПараметрыОбъектовОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПаспортаОбъектовОбслуживания" 

	Дано Я открываю основную форму списка справочника "СД_ПаспортаОбъектовОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПаспортаОбъектовОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПаспортаОбъектовОбслуживания"

	Дано Я открываю основную форму справочника "СД_ПаспортаОбъектовОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПаспортаОбъектовОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПривязкиПодразделенийКБазам" 

	Дано Я открываю основную форму списка справочника "СД_ПривязкиПодразделенийКБазам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПривязкиПодразделенийКБазам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПривязкиПодразделенийКБазам"

	Дано Я открываю основную форму справочника "СД_ПривязкиПодразделенийКБазам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПривязкиПодразделенийКБазам"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_МобильныеПриложения" 

	Дано Я открываю основную форму списка справочника "СД_МобильныеПриложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_МобильныеПриложения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_МобильныеПриложения"

	Дано Я открываю основную форму справочника "СД_МобильныеПриложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_МобильныеПриложения"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Контрагенты" 

	Дано Я открываю основную форму списка справочника "СД_Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Контрагенты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Контрагенты"

	Дано Я открываю основную форму справочника "СД_Контрагенты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Контрагенты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ГруппыНоменклатуры" 

	Дано Я открываю основную форму списка справочника "СД_ГруппыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ГруппыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ГруппыНоменклатуры"

	Дано Я открываю основную форму справочника "СД_ГруппыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ГруппыНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПричиныОтменыЧека" 

	Дано Я открываю основную форму списка справочника "СД_ПричиныОтменыЧека"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПричиныОтменыЧека"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПричиныОтменыЧека"

	Дано Я открываю основную форму справочника "СД_ПричиныОтменыЧека"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ПричиныОтменыЧека"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_КатегорииОбъектовОбслуживания" 

	Дано Я открываю основную форму списка справочника "СД_КатегорииОбъектовОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КатегорииОбъектовОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_КатегорииОбъектовОбслуживания"

	Дано Я открываю основную форму справочника "СД_КатегорииОбъектовОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КатегорииОбъектовОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_КлассификаторЕдиницИзмерения" 

	Дано Я открываю основную форму списка справочника "СД_КлассификаторЕдиницИзмерения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КлассификаторЕдиницИзмерения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_КлассификаторЕдиницИзмерения"

	Дано Я открываю основную форму справочника "СД_КлассификаторЕдиницИзмерения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_КлассификаторЕдиницИзмерения"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ИзменениеОборудования" 

	Дано Я открываю основную форму списка справочника "СД_ИзменениеОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИзменениеОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ИзменениеОборудования"

	Дано Я открываю основную форму справочника "СД_ИзменениеОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИзменениеОборудования"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ИзменениеКлассификаторОборудования" 

	Дано Я открываю основную форму списка справочника "СД_ИзменениеКлассификаторОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИзменениеКлассификаторОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ИзменениеКлассификаторОборудования"

	Дано Я открываю основную форму справочника "СД_ИзменениеКлассификаторОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ИзменениеКлассификаторОборудования"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ОснованияОтключенияОборудования" 

	Дано Я открываю основную форму списка справочника "СД_ОснованияОтключенияОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОснованияОтключенияОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОснованияОтключенияОборудования"

	Дано Я открываю основную форму справочника "СД_ОснованияОтключенияОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ОснованияОтключенияОборудования"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ВидыНоменклатуры" 

	Дано Я открываю основную форму списка справочника "СД_ВидыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВидыНоменклатуры"

	Дано Я открываю основную форму справочника "СД_ВидыНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ВидыНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_НоменклатураПрисоединенныеФайлы" 

	Дано Я открываю основную форму списка справочника "СД_НоменклатураПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НоменклатураПрисоединенныеФайлы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_НоменклатураПрисоединенныеФайлы"

	Дано Я открываю основную форму справочника "СД_НоменклатураПрисоединенныеФайлы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_НоменклатураПрисоединенныеФайлы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ГруппыТерриторий" 

	Дано Я открываю основную форму списка справочника "СД_ГруппыТерриторий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ГруппыТерриторий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ГруппыТерриторий"

	Дано Я открываю основную форму справочника "СД_ГруппыТерриторий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_ГруппыТерриторий"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Алгоритмы" 

	Дано Я открываю основную форму списка справочника "СД_Алгоритмы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Алгоритмы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Алгоритмы"

	Дано Я открываю основную форму справочника "СД_Алгоритмы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму справочника СД_Алгоритмы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "Анкета" 

	Дано Я открываю основную форму списка документа "Анкета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Анкета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "Анкета"

	Дано Я открываю основную форму документа "Анкета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Анкета"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "Встреча" 

	Дано Я открываю основную форму списка документа "Встреча"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Встреча"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "Встреча"

	Дано Я открываю основную форму документа "Встреча"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа Встреча"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗапланированноеВзаимодействие" 

	Дано Я открываю основную форму списка документа "ЗапланированноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапланированноеВзаимодействие"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗапланированноеВзаимодействие"

	Дано Я открываю основную форму документа "ЗапланированноеВзаимодействие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЗапланированноеВзаимодействие"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НазначениеОпросов" 

	Дано Я открываю основную форму списка документа "НазначениеОпросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеОпросов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НазначениеОпросов"

	Дано Я открываю основную форму документа "НазначениеОпросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа НазначениеОпросов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ОтзывСогласияНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка документа "ОтзывСогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОтзывСогласияНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму документа "ОтзывСогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ОтзывСогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СогласиеНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка документа "СогласиеНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СогласиеНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму документа "СогласиеНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СогласиеНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СообщениеSMS" 

	Дано Я открываю основную форму списка документа "СообщениеSMS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеSMS"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СообщениеSMS"

	Дано Я открываю основную форму документа "СообщениеSMS"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СообщениеSMS"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ТелефонныйЗвонок" 

	Дано Я открываю основную форму списка документа "ТелефонныйЗвонок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТелефонныйЗвонок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ТелефонныйЗвонок"

	Дано Я открываю основную форму документа "ТелефонныйЗвонок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ТелефонныйЗвонок"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоВходящее" 

	Дано Я открываю основную форму списка документа "ЭлектронноеПисьмоВходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоВходящее"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЭлектронноеПисьмоВходящее"

	Дано Я открываю основную форму документа "ЭлектронноеПисьмоВходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоВходящее"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЭлектронноеПисьмоИсходящее" 

	Дано Я открываю основную форму списка документа "ЭлектронноеПисьмоИсходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоИсходящее"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЭлектронноеПисьмоИсходящее"

	Дано Я открываю основную форму документа "ЭлектронноеПисьмоИсходящее"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа ЭлектронноеПисьмоИсходящее"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ЗаявкаАбонента" 

	Дано Я открываю основную форму списка документа "СД_ЗаявкаАбонента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ЗаявкаАбонента"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЗаявкаАбонента"

	Дано Я открываю основную форму документа "СД_ЗаявкаАбонента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ЗаявкаАбонента"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПоказанияСчетчика" 

	Дано Я открываю основную форму списка документа "СД_ПоказанияСчетчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ПоказанияСчетчика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПоказанияСчетчика"

	Дано Я открываю основную форму документа "СД_ПоказанияСчетчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ПоказанияСчетчика"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Наряд" 

	Дано Я открываю основную форму списка документа "СД_Наряд"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_Наряд"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Наряд"

	Дано Я открываю основную форму документа "СД_Наряд"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_Наряд"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Операция" 

	Дано Я открываю основную форму списка документа "СД_Операция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_Операция"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Операция"

	Дано Я открываю основную форму документа "СД_Операция"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_Операция"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Задача" 

	Дано Я открываю основную форму списка документа "СД_Задача"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_Задача"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Задача"

	Дано Я открываю основную форму документа "СД_Задача"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_Задача"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ОтсутствиеРаботника" 

	Дано Я открываю основную форму списка документа "СД_ОтсутствиеРаботника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ОтсутствиеРаботника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОтсутствиеРаботника"

	Дано Я открываю основную форму документа "СД_ОтсутствиеРаботника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ОтсутствиеРаботника"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ВыходРаботника" 

	Дано Я открываю основную форму списка документа "СД_ВыходРаботника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ВыходРаботника"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВыходРаботника"

	Дано Я открываю основную форму документа "СД_ВыходРаботника"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ВыходРаботника"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ГрафикОбслуживания" 

	Дано Я открываю основную форму списка документа "СД_ГрафикОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ГрафикОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ГрафикОбслуживания"

	Дано Я открываю основную форму документа "СД_ГрафикОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ГрафикОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ГрафикОбслуживания_Удалить" 

	Дано Я открываю основную форму списка документа "СД_ГрафикОбслуживания_Удалить"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ГрафикОбслуживания_Удалить"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ГрафикОбслуживания_Удалить"

	Дано Я открываю основную форму документа "СД_ГрафикОбслуживания_Удалить"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ГрафикОбслуживания_Удалить"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Замечание" 

	Дано Я открываю основную форму списка документа "СД_Замечание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_Замечание"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Замечание"

	Дано Я открываю основную форму документа "СД_Замечание"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_Замечание"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПланОбслуживания" 

	Дано Я открываю основную форму списка документа "СД_ПланОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ПланОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПланОбслуживания"

	Дано Я открываю основную форму документа "СД_ПланОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ПланОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПоступлениеМатериалов" 

	Дано Я открываю основную форму списка документа "СД_ПоступлениеМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ПоступлениеМатериалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПоступлениеМатериалов"

	Дано Я открываю основную форму документа "СД_ПоступлениеМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ПоступлениеМатериалов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_СписаниеМатериалов" 

	Дано Я открываю основную форму списка документа "СД_СписаниеМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_СписаниеМатериалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СписаниеМатериалов"

	Дано Я открываю основную форму документа "СД_СписаниеМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_СписаниеМатериалов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПеремещениеМатериалов" 

	Дано Я открываю основную форму списка документа "СД_ПеремещениеМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ПеремещениеМатериалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПеремещениеМатериалов"

	Дано Я открываю основную форму документа "СД_ПеремещениеМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ПеремещениеМатериалов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_УстановкаЦен" 

	Дано Я открываю основную форму списка документа "СД_УстановкаЦен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_УстановкаЦен"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_УстановкаЦен"

	Дано Я открываю основную форму документа "СД_УстановкаЦен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_УстановкаЦен"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Оплата" 

	Дано Я открываю основную форму списка документа "СД_Оплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_Оплата"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Оплата"

	Дано Я открываю основную форму документа "СД_Оплата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_Оплата"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ВводОстатковПоВыполненнымРаботамПоОборудованию" 

	Дано Я открываю основную форму списка документа "СД_ВводОстатковПоВыполненнымРаботамПоОборудованию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ВводОстатковПоВыполненнымРаботамПоОборудованию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВводОстатковПоВыполненнымРаботамПоОборудованию"

	Дано Я открываю основную форму документа "СД_ВводОстатковПоВыполненнымРаботамПоОборудованию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ВводОстатковПоВыполненнымРаботамПоОборудованию"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_УстановкаНоменклатуры" 

	Дано Я открываю основную форму списка документа "СД_УстановкаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_УстановкаНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_УстановкаНоменклатуры"

	Дано Я открываю основную форму документа "СД_УстановкаНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_УстановкаНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ВводВЭксплуатациюОборудования" 

	Дано Я открываю основную форму списка документа "СД_ВводВЭксплуатациюОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ВводВЭксплуатациюОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВводВЭксплуатациюОборудования"

	Дано Я открываю основную форму документа "СД_ВводВЭксплуатациюОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ВводВЭксплуатациюОборудования"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ОбращениеПотребителя" 

	Дано Я открываю основную форму списка документа "СД_ОбращениеПотребителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ОбращениеПотребителя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОбращениеПотребителя"

	Дано Я открываю основную форму документа "СД_ОбращениеПотребителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму документа СД_ОбращениеПотребителя"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "АнализВерсийОбъектов"

	Дано Я открываю основную форму отчета "АнализВерсийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализВерсийОбъектов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "АнализЖурналаРегистрации"

	Дано Я открываю основную форму отчета "АнализЖурналаРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализЖурналаРегистрации"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "АнализОпроса"

	Дано Я открываю основную форму отчета "АнализОпроса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АнализОпроса"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "АналитическийОтчетПоАнкетированию"

	Дано Я открываю основную форму отчета "АналитическийОтчетПоАнкетированию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета АналитическийОтчетПоАнкетированию"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "БизнесПроцессы"

	Дано Я открываю основную форму отчета "БизнесПроцессы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета БизнесПроцессы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ДатыЗапретаЗагрузки"

	Дано Я открываю основную форму отчета "ДатыЗапретаЗагрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДатыЗапретаЗагрузки"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ДатыЗапретаИзменения"

	Дано Я открываю основную форму отчета "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДатыЗапретаИзменения"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ДвиженияДокумента"

	Дано Я открываю основную форму отчета "ДвиженияДокумента"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ДвиженияДокумента"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ЗависшиеЗадачи"

	Дано Я открываю основную форму отчета "ЗависшиеЗадачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗависшиеЗадачи"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "Задания"

	Дано Я открываю основную форму отчета "Задания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Задания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "Задачи"

	Дано Я открываю основную форму отчета "Задачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета Задачи"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ЗадачиИстекающиеНаДату"

	Дано Я открываю основную форму отчета "ЗадачиИстекающиеНаДату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ЗадачиИстекающиеНаДату"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ИспользуемыеВнешниеРесурсы"

	Дано Я открываю основную форму отчета "ИспользуемыеВнешниеРесурсы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ИспользуемыеВнешниеРесурсы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "МестаИспользованияСсылок"

	Дано Я открываю основную форму отчета "МестаИспользованияСсылок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета МестаИспользованияСсылок"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ОбъемНенужныхФайлов"

	Дано Я открываю основную форму отчета "ОбъемНенужныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОбъемНенужныхФайлов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ОценкаПроизводительности"

	Дано Я открываю основную форму отчета "ОценкаПроизводительности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОценкаПроизводительности"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ПраваДоступа"

	Дано Я открываю основную форму отчета "ПраваДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПраваДоступа"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ПроверкаЦелостностиТома"

	Дано Я открываю основную форму отчета "ПроверкаЦелостностиТома"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПроверкаЦелостностиТома"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ПрогрессОтложенногоОбновления"

	Дано Я открываю основную форму отчета "ПрогрессОтложенногоОбновления"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПрогрессОтложенногоОбновления"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ПросроченныеЗадачи"

	Дано Я открываю основную форму отчета "ПросроченныеЗадачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ПросроченныеЗадачи"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "РезультатыПроверкиУчета"

	Дано Я открываю основную форму отчета "РезультатыПроверкиУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета РезультатыПроверкиУчета"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СведенияОПользователях"

	Дано Я открываю основную форму отчета "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СведенияОПользователях"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СогласияНаОбработкуПерсональныхДанныхДействующие"

	Дано Я открываю основную форму отчета "СогласияНаОбработкуПерсональныхДанныхДействующие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СогласияНаОбработкуПерсональныхДанныхДействующие"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СогласияНаОбработкуПерсональныхДанныхИстекающие"

	Дано Я открываю основную форму отчета "СогласияНаОбработкуПерсональныхДанныхИстекающие"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СогласияНаОбработкуПерсональныхДанныхИстекающие"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "УниверсальныйОтчет"

	Дано Я открываю основную форму отчета "УниверсальныйОтчет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета УниверсальныйОтчет"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_Задачи"

	Дано Я открываю основную форму отчета "СД_Задачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_Задачи"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ОбслуженыеОбъекты"

	Дано Я открываю основную форму отчета "СД_ОбслуженыеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ОбслуженыеОбъекты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ЗадачиИстекающиеНаДату"

	Дано Я открываю основную форму отчета "СД_ЗадачиИстекающиеНаДату"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ЗадачиИстекающиеНаДату"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ПросроченныеЗадачи"

	Дано Я открываю основную форму отчета "СД_ПросроченныеЗадачи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ПросроченныеЗадачи"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ОтчетЗамеровВремени"

	Дано Я открываю основную форму отчета "ОтчетЗамеровВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета ОтчетЗамеровВремени"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ЗадачиПоГрафикуОбслуживания"

	Дано Я открываю основную форму отчета "СД_ЗадачиПоГрафикуОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ЗадачиПоГрафикуОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ЗадачиПоИсполнителям"

	Дано Я открываю основную форму отчета "СД_ЗадачиПоИсполнителям"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ЗадачиПоИсполнителям"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ОтчетПоСотрудникам"

	Дано Я открываю основную форму отчета "СД_ОтчетПоСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ОтчетПоСотрудникам"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ОтчетПоОбъектамОбслуживания"

	Дано Я открываю основную форму отчета "СД_ОтчетПоОбъектамОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ОтчетПоОбъектамОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ОтчетПоВидамРабот"

	Дано Я открываю основную форму отчета "СД_ОтчетПоВидамРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ОтчетПоВидамРабот"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ОтчетПоПлатнымУслугам"

	Дано Я открываю основную форму отчета "СД_ОтчетПоПлатнымУслугам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ОтчетПоПлатнымУслугам"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_СправкаПоОбъектуОбслуживания"

	Дано Я открываю основную форму отчета "СД_СправкаПоОбъектуОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_СправкаПоОбъектуОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_СправкаПоАбоненту"

	Дано Я открываю основную форму отчета "СД_СправкаПоАбоненту"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_СправкаПоАбоненту"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_СправкаПоСотруднику"

	Дано Я открываю основную форму отчета "СД_СправкаПоСотруднику"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_СправкаПоСотруднику"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_КонтрольДня"

	Дано Я открываю основную форму отчета "СД_КонтрольДня"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_КонтрольДня"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_КалендарьЗаявок"

	Дано Я открываю основную форму отчета "СД_КалендарьЗаявок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_КалендарьЗаявок"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ЗапросыНаИзменениеДанных"

	Дано Я открываю основную форму отчета "СД_ЗапросыНаИзменениеДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ЗапросыНаИзменениеДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ИсторияИзменений"

	Дано Я открываю основную форму отчета "СД_ИсторияИзменений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ИсторияИзменений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ОтчетПоАктуальнымУзламОбменаМобильныеСНеактуальнойВерсией"

	Дано Я открываю основную форму отчета "СД_ОтчетПоАктуальнымУзламОбменаМобильныеСНеактуальнойВерсией"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ОтчетПоАктуальнымУзламОбменаМобильныеСНеактуальнойВерсией"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ОтчетПоГрафкамОбслуживанияГодовой"

	Дано Я открываю основную форму отчета "СД_ОтчетПоГрафкамОбслуживанияГодовой"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ОтчетПоГрафкамОбслуживанияГодовой"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_СводныйОтчетПоПланамОбслуживания"

	Дано Я открываю основную форму отчета "СД_СводныйОтчетПоПланамОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_СводныйОтчетПоПланамОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ОтчетПоМатериалам"

	Дано Я открываю основную форму отчета "СД_ОтчетПоМатериалам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ОтчетПоМатериалам"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ОтчетОплатПотребителей"

	Дано Я открываю основную форму отчета "СД_ОтчетОплатПотребителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ОтчетОплатПотребителей"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ВедомостьСписанияМатериалов"

	Дано Я открываю основную форму отчета "СД_ВедомостьСписанияМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ВедомостьСписанияМатериалов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_РеестрАннулированныхЧеков"

	Дано Я открываю основную форму отчета "СД_РеестрАннулированныхЧеков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_РеестрАннулированныхЧеков"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ОперативныйОтчетПоВыполнениюГрафиковОбслуживания"

	Дано Я открываю основную форму отчета "СД_ОперативныйОтчетПоВыполнениюГрафиковОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму отчета СД_ОперативныйОтчетПоВыполнениюГрафиковОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "АвтоматическоеИзвлечениеТекстов"

	Дано Я открываю основную форму обработки "АвтоматическоеИзвлечениеТекстов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АвтоматическоеИзвлечениеТекстов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "АктивныеПользователи"

	Дано Я открываю основную форму обработки "АктивныеПользователи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки АктивныеПользователи"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "БлокировкаРаботыПользователей"

	Дано Я открываю основную форму обработки "БлокировкаРаботыПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки БлокировкаРаботыПользователей"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ВводКонтактнойИнформации"

	Дано Я открываю основную форму обработки "ВводКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВводКонтактнойИнформации"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ВыгрузкаЗагрузкаEnterpriseData"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаEnterpriseData"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаEnterpriseData"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ВыполнениеОбменаДанными"

	Дано Я открываю основную форму обработки "ВыполнениеОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыполнениеОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ГрупповоеИзменениеРеквизитов"

	Дано Я открываю основную форму обработки "ГрупповоеИзменениеРеквизитов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ГрупповоеИзменениеРеквизитов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ДоступныеАнкеты"

	Дано Я открываю основную форму обработки "ДоступныеАнкеты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ДоступныеАнкеты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ЖурналРегистрации"

	Дано Я открываю основную форму обработки "ЖурналРегистрации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЖурналРегистрации"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ЗагрузкаДанныхИзФайла"

	Дано Я открываю основную форму обработки "ЗагрузкаДанныхИзФайла"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаДанныхИзФайла"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ЗагрузкаКлассификатораБанков"

	Дано Я открываю основную форму обработки "ЗагрузкаКлассификатораБанков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаКлассификатораБанков"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ЗагрузкаКурсовВалют"

	Дано Я открываю основную форму обработки "ЗагрузкаКурсовВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаКурсовВалют"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ЗагрузкаПравилРегистрацииОбъектов"

	Дано Я открываю основную форму обработки "ЗагрузкаПравилРегистрацииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗагрузкаПравилРегистрацииОбъектов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ЗаменаИОбъединениеЭлементов"

	Дано Я открываю основную форму обработки "ЗаменаИОбъединениеЭлементов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаменаИОбъединениеЭлементов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ЗаполнениеГрафиковРаботы"

	Дано Я открываю основную форму обработки "ЗаполнениеГрафиковРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеГрафиковРаботы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ЗаполнениеКалендарныхГрафиков"

	Дано Я открываю основную форму обработки "ЗаполнениеКалендарныхГрафиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаполнениеКалендарныхГрафиков"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ЗащитаПерсональныхДанных"

	Дано Я открываю основную форму обработки "ЗащитаПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗащитаПерсональныхДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"

	Дано Я открываю основную форму обработки "ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗаявлениеНаВыпускНовогоКвалифицированногоСертификата"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ИнтерактивноеИзменениеВыгрузки"

	Дано Я открываю основную форму обработки "ИнтерактивноеИзменениеВыгрузки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнтерактивноеИзменениеВыгрузки"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ИнформацияПриЗапуске"

	Дано Я открываю основную форму обработки "ИнформацияПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ИнформацияПриЗапуске"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "КартаМаршрутаБизнесПроцесса"

	Дано Я открываю основную форму обработки "КартаМаршрутаБизнесПроцесса"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КартаМаршрутаБизнесПроцесса"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "КонвертацияОбъектовXDTO"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовXDTO"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовXDTO"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "КонвертацияОбъектовИнформационныхБаз"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "КонвертацияОбъектовРаспределенныхИнформационныхБаз"

	Дано Я открываю основную форму обработки "КонвертацияОбъектовРаспределенныхИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонвертацияОбъектовРаспределенныхИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ЛегальностьПолученияОбновлений"

	Дано Я открываю основную форму обработки "ЛегальностьПолученияОбновлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЛегальностьПолученияОбновлений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму обработки "НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "НастройкаРезервногоКопированияИБ"

	Дано Я открываю основную форму обработки "НастройкаРезервногоКопированияИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРезервногоКопированияИБ"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "НастройкаРезервногоКопированияПриложения"

	Дано Я открываю основную форму обработки "НастройкаРезервногоКопированияПриложения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкаРезервногоКопированияПриложения"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "НастройкиПользователей"

	Дано Я открываю основную форму обработки "НастройкиПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиПользователей"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "НастройкиЦентраМониторинга"

	Дано Я открываю основную форму обработки "НастройкиЦентраМониторинга"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НастройкиЦентраМониторинга"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "НерекомендуемаяВерсияПлатформы"

	Дано Я открываю основную форму обработки "НерекомендуемаяВерсияПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НерекомендуемаяВерсияПлатформы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ОценкаПроизводительности"

	Дано Я открываю основную форму обработки "ОценкаПроизводительности"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОценкаПроизводительности"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ПанельАдминистрированияБСП"

	Дано Я открываю основную форму обработки "ПанельАдминистрированияБСП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПанельАдминистрированияБСП"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ПереносФайловВТома"

	Дано Я открываю основную форму обработки "ПереносФайловВТома"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПереносФайловВТома"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ПодключениеОбсуждений"

	Дано Я открываю основную форму обработки "ПодключениеОбсуждений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПодключениеОбсуждений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ПоискИУдалениеДублей"

	Дано Я открываю основную форму обработки "ПоискИУдалениеДублей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПоискИУдалениеДублей"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ПолнотекстовыйПоискВДанных"

	Дано Я открываю основную форму обработки "ПолнотекстовыйПоискВДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПолнотекстовыйПоискВДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ПомощникИнтерактивногоОбменаДанными"

	Дано Я открываю основную форму обработки "ПомощникИнтерактивногоОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникИнтерактивногоОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ПомощникСозданияОбменаДанными"

	Дано Я открываю основную форму обработки "ПомощникСозданияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПомощникСозданияОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ПрограммыЭлектроннойПодписиИШифрования"

	Дано Я открываю основную форму обработки "ПрограммыЭлектроннойПодписиИШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ПрограммыЭлектроннойПодписиИШифрования"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "РаботаСФайлами"

	Дано Я открываю основную форму обработки "РаботаСФайлами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РаботаСФайлами"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "РасширенныйВводКонтактнойИнформации"

	Дано Я открываю основную форму обработки "РасширенныйВводКонтактнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РасширенныйВводКонтактнойИнформации"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "РегистрацияИзмененийДляОбменаДанными"

	Дано Я открываю основную форму обработки "РегистрацияИзмененийДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РегистрацияИзмененийДляОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "РегламентныеИФоновыеЗадания"

	Дано Я открываю основную форму обработки "РегламентныеИФоновыеЗадания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РегламентныеИФоновыеЗадания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "РезервноеКопированиеИБ"

	Дано Я открываю основную форму обработки "РезервноеКопированиеИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РезервноеКопированиеИБ"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "РезультатыОбновленияПрограммы"

	Дано Я открываю основную форму обработки "РезультатыОбновленияПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РезультатыОбновленияПрограммы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "РекомендацияПоПовышениюСкоростиРаботы"

	Дано Я открываю основную форму обработки "РекомендацияПоПовышениюСкоростиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки РекомендацияПоПовышениюСкоростиРаботы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СдвигГраницыИтогов"

	Дано Я открываю основную форму обработки "СдвигГраницыИтогов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СдвигГраницыИтогов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "Сканирование"

	Дано Я открываю основную форму обработки "Сканирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки Сканирование"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СкрытиеКонфиденциальнойИнформации"

	Дано Я открываю основную форму обработки "СкрытиеКонфиденциальнойИнформации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СкрытиеКонфиденциальнойИнформации"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СопоставлениеОбъектовИнформационныхБаз"

	Дано Я открываю основную форму обработки "СопоставлениеОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СопоставлениеОбъектовИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ТекущиеДела"

	Дано Я открываю основную форму обработки "ТекущиеДела"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТекущиеДела"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ТранспортСообщенийОбменаEMAIL"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаEMAIL"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаEMAIL"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ТранспортСообщенийОбменаFILE"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаFILE"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаFILE"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ТранспортСообщенийОбменаFTP"

	Дано Я открываю основную форму обработки "ТранспортСообщенийОбменаFTP"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ТранспортСообщенийОбменаFTP"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "УдалениеПомеченныхОбъектов"

	Дано Я открываю основную форму обработки "УдалениеПомеченныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УдалениеПомеченныхОбъектов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "УниверсальныйОбменДаннымиXML"

	Дано Я открываю основную форму обработки "УниверсальныйОбменДаннымиXML"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УниверсальныйОбменДаннымиXML"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "УправлениеИтогамиИАгрегатами"

	Дано Я открываю основную форму обработки "УправлениеИтогамиИАгрегатами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УправлениеИтогамиИАгрегатами"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "УстановкаОбновлений"

	Дано Я открываю основную форму обработки "УстановкаОбновлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки УстановкаОбновлений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_АРМ_Руководителя"

	Дано Я открываю основную форму обработки "СД_АРМ_Руководителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_АРМ_Руководителя"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_МастерСозданияОбъектаОбслуживания"

	Дано Я открываю основную форму обработки "СД_МастерСозданияОбъектаОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_МастерСозданияОбъектаОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ЗаполнениеГрафика"

	Дано Я открываю основную форму обработки "СД_ЗаполнениеГрафика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ЗаполнениеГрафика"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ОбновлениеВспомогательныхДанных"

	Дано Я открываю основную форму обработки "ОбновлениеВспомогательныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ОбновлениеВспомогательныхДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ВыгрузкаЗагрузкаДанныхXML"

	Дано Я открываю основную форму обработки "ВыгрузкаЗагрузкаДанныхXML"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ВыгрузкаЗагрузкаДанныхXML"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "ЗамерСкоростиОткрытияФорм"

	Дано Я открываю основную форму обработки "ЗамерСкоростиОткрытияФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки ЗамерСкоростиОткрытияФорм"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_РеорганизацияГеозон"

	Дано Я открываю основную форму обработки "СД_РеорганизацияГеозон"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_РеорганизацияГеозон"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "КонсольЗапросов"

	Дано Я открываю основную форму обработки "КонсольЗапросов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки КонсольЗапросов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ОтправитьPush"

	Дано Я открываю основную форму обработки "СД_ОтправитьPush"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ОтправитьPush"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ЗакрытиеОперДня"

	Дано Я открываю основную форму обработки "СД_ЗакрытиеОперДня"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ЗакрытиеОперДня"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ФормированиеЦен"

	Дано Я открываю основную форму обработки "СД_ФормированиеЦен"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ФормированиеЦен"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_Автопланировщик"

	Дано Я открываю основную форму обработки "СД_Автопланировщик"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_Автопланировщик"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_Путеводитель"

	Дано Я открываю основную форму обработки "СД_Путеводитель"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_Путеводитель"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ОбработкаДанных"

	Дано Я открываю основную форму обработки "СД_ОбработкаДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ОбработкаДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_КонтрольДня"

	Дано Я открываю основную форму обработки "СД_КонтрольДня"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_КонтрольДня"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_НачалоДня"

	Дано Я открываю основную форму обработки "СД_НачалоДня"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_НачалоДня"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "НагрузочноеТестирование"

	Дано Я открываю основную форму обработки "НагрузочноеТестирование"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки НагрузочноеТестирование"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ПечатьФорма6ЭГ"

	Дано Я открываю основную форму обработки "СД_ПечатьФорма6ЭГ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ПечатьФорма6ЭГ"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ПечатьФорма6ОФ"

	Дано Я открываю основную форму обработки "СД_ПечатьФорма6ОФ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ПечатьФорма6ОФ"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ПечатьФорма11АС"

	Дано Я открываю основную форму обработки "СД_ПечатьФорма11АС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ПечатьФорма11АС"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ЗагрузкаПараметровМаршрута"

	Дано Я открываю основную форму обработки "СД_ЗагрузкаПараметровМаршрута"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ЗагрузкаПараметровМаршрута"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ЗагрузкаДанныхИзВнешнихСистем"

	Дано Я открываю основную форму обработки "СД_ЗагрузкаДанныхИзВнешнихСистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ЗагрузкаДанныхИзВнешнихСистем"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_ЗагрузкаДанныхОборудованияБреминКагаз"

	Дано Я открываю основную форму обработки "СД_ЗагрузкаДанныхОборудованияБреминКагаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_ЗагрузкаДанныхОборудованияБреминКагаз"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...

Сценарий: Открытие формы объкта "СД_СопоставлениеТарифовИВидовРабот"

	Дано Я открываю основную форму обработки "СД_СопоставлениеТарифовИВидовРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму обработки СД_СопоставлениеТарифовИВидовРабот"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "АдресныеОбъекты" 

	Дано Я открываю основную форму списка регистра сведений "АдресныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресныеОбъекты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "АдресныеОбъекты"

	Дано Я открываю основную форму регистра сведений "АдресныеОбъекты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений АдресныеОбъекты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "БезопасноеХранилищеДанных" 

	Дано Я открываю основную форму списка регистра сведений "БезопасноеХранилищеДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "БезопасноеХранилищеДанных"

	Дано Я открываю основную форму регистра сведений "БезопасноеХранилищеДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "БезопасноеХранилищеДанныхОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "БезопасноеХранилищеДанныхОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанныхОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "БезопасноеХранилищеДанныхОбластейДанных"

	Дано Я открываю основную форму регистра сведений "БезопасноеХранилищеДанныхОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БезопасноеХранилищеДанныхОбластейДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "БлокировкиСеансовОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "БлокировкиСеансовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСеансовОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "БлокировкиСеансовОбластейДанных"

	Дано Я открываю основную форму регистра сведений "БлокировкиСеансовОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БлокировкиСеансовОбластейДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "БуферОперацийСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "БуферОперацийСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БуферОперацийСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "БуферОперацийСтатистики"

	Дано Я открываю основную форму регистра сведений "БуферОперацийСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений БуферОперацийСтатистики"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ВерсииОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВерсииОбъектов"

	Дано Я открываю основную форму регистра сведений "ВерсииОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииОбъектов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ВерсииПодсистем" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВерсииПодсистем"

	Дано Я открываю основную форму регистра сведений "ВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистем"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ВерсииПодсистемОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "ВерсииПодсистемОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистемОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ВерсииПодсистемОбластейДанных"

	Дано Я открываю основную форму регистра сведений "ВерсииПодсистемОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ВерсииПодсистемОбластейДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ГруппыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ГруппыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "ГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ГруппыЗначенийДоступа"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ДампыПлатформы" 

	Дано Я открываю основную форму списка регистра сведений "ДампыПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДампыПлатформы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ДампыПлатформы"

	Дано Я открываю основную форму регистра сведений "ДампыПлатформы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДампыПлатформы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ДанныеБизнесПроцессов" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеБизнесПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеБизнесПроцессов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ДанныеБизнесПроцессов"

	Дано Я открываю основную форму регистра сведений "ДанныеБизнесПроцессов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеБизнесПроцессов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ДанныеОбработанныеВЦентральномУзлеРИБ" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОбработанныеВЦентральномУзлеРИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбработанныеВЦентральномУзлеРИБ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ДанныеОбработанныеВЦентральномУзлеРИБ"

	Дано Я открываю основную форму регистра сведений "ДанныеОбработанныеВЦентральномУзлеРИБ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбработанныеВЦентральномУзлеРИБ"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ДанныеОбъектовДляРегистрацииВОбменах" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеОбъектовДляРегистрацииВОбменах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбъектовДляРегистрацииВОбменах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ДанныеОбъектовДляРегистрацииВОбменах"

	Дано Я открываю основную форму регистра сведений "ДанныеОбъектовДляРегистрацииВОбменах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеОбъектовДляРегистрацииВОбменах"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ДанныеПроизводственногоКалендаря" 

	Дано Я открываю основную форму списка регистра сведений "ДанныеПроизводственногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаря"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ДанныеПроизводственногоКалендаря"

	Дано Я открываю основную форму регистра сведений "ДанныеПроизводственногоКалендаря"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДанныеПроизводственногоКалендаря"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ДатыЗапретаИзменения" 

	Дано Я открываю основную форму списка регистра сведений "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗапретаИзменения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ДатыЗапретаИзменения"

	Дано Я открываю основную форму регистра сведений "ДатыЗапретаИзменения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыЗапретаИзменения"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ДатыПоследнейЗагрузкиПочтовыхСообщений" 

	Дано Я открываю основную форму списка регистра сведений "ДатыПоследнейЗагрузкиПочтовыхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоследнейЗагрузкиПочтовыхСообщений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ДатыПоследнейЗагрузкиПочтовыхСообщений"

	Дано Я открываю основную форму регистра сведений "ДатыПоследнейЗагрузкиПочтовыхСообщений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДатыПоследнейЗагрузкиПочтовыхСообщений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ДвоичныеДанныеФайлов" 

	Дано Я открываю основную форму списка регистра сведений "ДвоичныеДанныеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДвоичныеДанныеФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ДвоичныеДанныеФайлов"

	Дано Я открываю основную форму регистра сведений "ДвоичныеДанныеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДвоичныеДанныеФайлов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ДомаЗданияСтроения" 

	Дано Я открываю основную форму списка регистра сведений "ДомаЗданияСтроения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДомаЗданияСтроения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ДомаЗданияСтроения"

	Дано Я открываю основную форму регистра сведений "ДомаЗданияСтроения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДомаЗданияСтроения"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ДополнительныеАдресныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеАдресныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ДополнительныеАдресныеСведения"

	Дано Я открываю основную форму регистра сведений "ДополнительныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеАдресныеСведения"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ДополнительныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "ДополнительныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ДополнительныеСведения"

	Дано Я открываю основную форму регистра сведений "ДополнительныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ДополнительныеСведения"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗаблокированныеДляПолученияУчетныеЗаписи" 

	Дано Я открываю основную форму списка регистра сведений "ЗаблокированныеДляПолученияУчетныеЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаблокированныеДляПолученияУчетныеЗаписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗаблокированныеДляПолученияУчетныеЗаписи"

	Дано Я открываю основную форму регистра сведений "ЗаблокированныеДляПолученияУчетныеЗаписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗаблокированныеДляПолученияУчетныеЗаписи"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗависимостиПравДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ЗависимостиПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗависимостиПравДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗависимостиПравДоступа"

	Дано Я открываю основную форму регистра сведений "ЗависимостиПравДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗависимостиПравДоступа"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗагруженныеВерсииАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "ЗагруженныеВерсииАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗагруженныеВерсииАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗагруженныеВерсииАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "ЗагруженныеВерсииАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗагруженныеВерсииАдресныхСведений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗамерыВремени" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗамерыВремени"

	Дано Я открываю основную форму регистра сведений "ЗамерыВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремени"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗамерыВремениТехнологические" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремениТехнологические"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗамерыВремениТехнологические"

	Дано Я открываю основную форму регистра сведений "ЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыВремениТехнологические"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗамерыКомментарииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыКомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыКомментарииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗамерыКомментарииСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыКомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыКомментарииСтатистики"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗамерыОбластиСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОбластиСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗамерыОбластиСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОбластиСтатистики"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗамерыОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗамерыОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыОперацииСтатистики"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗамерыСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ЗамерыСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗамерыСтатистики"

	Дано Я открываю основную форму регистра сведений "ЗамерыСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗамерыСтатистики"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов" 

	Дано Я открываю основную форму списка регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму регистра сведений "ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗапросыРазрешенийНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗначенияГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗначенияГруппДоступа"

	Дано Я открываю основную форму регистра сведений "ЗначенияГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступа"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЗначенияГруппДоступаПоУмолчанию" 

	Дано Я открываю основную форму списка регистра сведений "ЗначенияГруппДоступаПоУмолчанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступаПоУмолчанию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЗначенияГруппДоступаПоУмолчанию"

	Дано Я открываю основную форму регистра сведений "ЗначенияГруппДоступаПоУмолчанию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЗначенияГруппДоступаПоУмолчанию"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ИдентификаторыОбъектовВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыОбъектовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыОбъектовВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ИдентификаторыОбъектовВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыОбъектовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыОбъектовВерсийРасширений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ИдентификаторыПолученныхЭлектронныхПисем" 

	Дано Я открываю основную форму списка регистра сведений "ИдентификаторыПолученныхЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыПолученныхЭлектронныхПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ИдентификаторыПолученныхЭлектронныхПисем"

	Дано Я открываю основную форму регистра сведений "ИдентификаторыПолученныхЭлектронныхПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИдентификаторыПолученныхЭлектронныхПисем"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ИзмененияОбщихДанныхУзлов" 

	Дано Я открываю основную форму списка регистра сведений "ИзмененияОбщихДанныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияОбщихДанныхУзлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ИзмененияОбщихДанныхУзлов"

	Дано Я открываю основную форму регистра сведений "ИзмененияОбщихДанныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИзмененияОбщихДанныхУзлов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ИсполнителиЗадач" 

	Дано Я открываю основную форму списка регистра сведений "ИсполнителиЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсполнителиЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ИсполнителиЗадач"

	Дано Я открываю основную форму регистра сведений "ИсполнителиЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсполнителиЗадач"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ИсторияАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ИсторияАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияАдресныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ИсторияАдресныхОбъектов"

	Дано Я открываю основную форму регистра сведений "ИсторияАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ИсторияАдресныхОбъектов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "КалендарныеГрафики" 

	Дано Я открываю основную форму списка регистра сведений "КалендарныеГрафики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КалендарныеГрафики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "КалендарныеГрафики"

	Дано Я открываю основную форму регистра сведений "КалендарныеГрафики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КалендарныеГрафики"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "КодировкиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "КодировкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодировкиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "КодировкиФайлов"

	Дано Я открываю основную форму регистра сведений "КодировкиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КодировкиФайлов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "КомментарииОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "КомментарииОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "КомментарииОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "КомментарииОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииОперацииСтатистики"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "КомментарииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "КомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "КомментарииСтатистики"

	Дано Я открываю основную форму регистра сведений "КомментарииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КомментарииСтатистики"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "КонтактыВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "КонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтактыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "КонтактыВзаимодействий"

	Дано Я открываю основную форму регистра сведений "КонтактыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КонтактыВзаимодействий"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "КурсыВалют" 

	Дано Я открываю основную форму списка регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "КурсыВалют"

	Дано Я открываю основную форму регистра сведений "КурсыВалют"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КурсыВалют"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "КэшПрограммныхИнтерфейсов" 

	Дано Я открываю основную форму списка регистра сведений "КэшПрограммныхИнтерфейсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшПрограммныхИнтерфейсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "КэшПрограммныхИнтерфейсов"

	Дано Я открываю основную форму регистра сведений "КэшПрограммныхИнтерфейсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений КэшПрограммныхИнтерфейсов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НаборыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "НаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаборыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НаборыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "НаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаборыЗначенийДоступа"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НазначениеДополнительныхОбработок" 

	Дано Я открываю основную форму списка регистра сведений "НазначениеДополнительныхОбработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НазначениеДополнительныхОбработок"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НазначениеДополнительныхОбработок"

	Дано Я открываю основную форму регистра сведений "НазначениеДополнительныхОбработок"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НазначениеДополнительныхОбработок"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НаличиеФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НаличиеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НаличиеФайлов"

	Дано Я открываю основную форму регистра сведений "НаличиеФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаличиеФайлов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НапоминанияПользователя" 

	Дано Я открываю основную форму списка регистра сведений "НапоминанияПользователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НапоминанияПользователя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НапоминанияПользователя"

	Дано Я открываю основную форму регистра сведений "НапоминанияПользователя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НапоминанияПользователя"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НаследованиеНастроекПравОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НаследованиеНастроекПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаследованиеНастроекПравОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НаследованиеНастроекПравОбъектов"

	Дано Я открываю основную форму регистра сведений "НаследованиеНастроекПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НаследованиеНастроекПравОбъектов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НастройкиВариантовОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВариантовОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВариантовОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НастройкиВариантовОтчетов"

	Дано Я открываю основную форму регистра сведений "НастройкиВариантовОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВариантовОтчетов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НастройкиВерсионированияОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НастройкиВерсионированияОбъектов"

	Дано Я открываю основную форму регистра сведений "НастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НастройкиКомандПечати" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиКомандПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКомандПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НастройкиКомандПечати"

	Дано Я открываю основную форму регистра сведений "НастройкиКомандПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиКомандПечати"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НастройкиОтправителя" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОтправителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправителя"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НастройкиОтправителя"

	Дано Я открываю основную форму регистра сведений "НастройкиОтправителя"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОтправителя"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НастройкиОчисткиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиОчисткиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОчисткиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НастройкиОчисткиФайлов"

	Дано Я открываю основную форму регистра сведений "НастройкиОчисткиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиОчисткиФайлов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НастройкиПравОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПравОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НастройкиПравОбъектов"

	Дано Я открываю основную форму регистра сведений "НастройкиПравОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиПравОбъектов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НастройкиСинхронизацииФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСинхронизацииФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НастройкиСинхронизацииФайлов"

	Дано Я открываю основную форму регистра сведений "НастройкиСинхронизацииФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиСинхронизацииФайлов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НастройкиТранспортаОбмена" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиТранспортаОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НастройкиТранспортаОбмена"

	Дано Я открываю основную форму регистра сведений "НастройкиТранспортаОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиТранспортаОбмена"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НастройкиУчетныхЗаписейЭлектроннойПочты" 

	Дано Я открываю основную форму списка регистра сведений "НастройкиУчетныхЗаписейЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхЗаписейЭлектроннойПочты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НастройкиУчетныхЗаписейЭлектроннойПочты"

	Дано Я открываю основную форму регистра сведений "НастройкиУчетныхЗаписейЭлектроннойПочты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НастройкиУчетныхЗаписейЭлектроннойПочты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма" 

	Дано Я открываю основную форму списка регистра сведений "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"

	Дано Я открываю основную форму регистра сведений "НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НепринятыеКОбработкеПочтовымСерверомИсходящиеПисьма"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "НомераОтсканированныхФайлов" 

	Дано Я открываю основную форму списка регистра сведений "НомераОтсканированныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НомераОтсканированныхФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "НомераОтсканированныхФайлов"

	Дано Я открываю основную форму регистра сведений "НомераОтсканированныхФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений НомераОтсканированныхФайлов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОбластиДанных"

	Дано Я открываю основную форму регистра сведений "ОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ОбластиПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОбластиПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "ОбластиПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиПерсональныхДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ОбластиСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОбластиСтатистики"

	Дано Я открываю основную форму регистра сведений "ОбластиСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиСтатистики"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ОбластиТребующиеОбработкиПоставляемыхДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбластиТребующиеОбработкиПоставляемыхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиТребующиеОбработкиПоставляемыхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОбластиТребующиеОбработкиПоставляемыхДанных"

	Дано Я открываю основную форму регистра сведений "ОбластиТребующиеОбработкиПоставляемыхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбластиТребующиеОбработкиПоставляемыхДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ОбработчикиСобытийСинхронизацииДанных" 

	Дано Я открываю основную форму списка регистра сведений "ОбработчикиСобытийСинхронизацииДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиСобытийСинхронизацииДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОбработчикиСобытийСинхронизацииДанных"

	Дано Я открываю основную форму регистра сведений "ОбработчикиСобытийСинхронизацииДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбработчикиСобытийСинхронизацииДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ОбщиеНастройкиУзловИнформационныхБаз" 

	Дано Я открываю основную форму списка регистра сведений "ОбщиеНастройкиУзловИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеНастройкиУзловИнформационныхБаз"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОбщиеНастройкиУзловИнформационныхБаз"

	Дано Я открываю основную форму регистра сведений "ОбщиеНастройкиУзловИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОбщиеНастройкиУзловИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ОперацииСтатистики" 

	Дано Я открываю основную форму списка регистра сведений "ОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииСтатистики"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОперацииСтатистики"

	Дано Я открываю основную форму регистра сведений "ОперацииСтатистики"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОперацииСтатистики"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ОриентирыАдресныхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ОриентирыАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОриентирыАдресныхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОриентирыАдресныхОбъектов"

	Дано Я открываю основную форму регистра сведений "ОриентирыАдресныхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОриентирыАдресныхОбъектов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ОтветыНаВопросыАнкет" 

	Дано Я открываю основную форму списка регистра сведений "ОтветыНаВопросыАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаВопросыАнкет"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОтветыНаВопросыАнкет"

	Дано Я открываю основную форму регистра сведений "ОтветыНаВопросыАнкет"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОтветыНаВопросыАнкет"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ОчередьИзвлеченияТекста" 

	Дано Я открываю основную форму списка регистра сведений "ОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ОчередьИзвлеченияТекста"

	Дано Я открываю основную форму регистра сведений "ОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ОчередьИзвлеченияТекста"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПакетыДляОтправки" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыДляОтправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыДляОтправки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПакетыДляОтправки"

	Дано Я открываю основную форму регистра сведений "ПакетыДляОтправки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыДляОтправки"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПакетыИнформацииПриЗапуске" 

	Дано Я открываю основную форму списка регистра сведений "ПакетыИнформацииПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыИнформацииПриЗапуске"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПакетыИнформацииПриЗапуске"

	Дано Я открываю основную форму регистра сведений "ПакетыИнформацииПриЗапуске"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПакетыИнформацииПриЗапуске"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПараметрыРаботыВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыРаботыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПараметрыРаботыВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ПараметрыРаботыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыВерсийРасширений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПараметрыРаботыПрограммы" 

	Дано Я открываю основную форму списка регистра сведений "ПараметрыРаботыПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыПрограммы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПараметрыРаботыПрограммы"

	Дано Я открываю основную форму регистра сведений "ПараметрыРаботыПрограммы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПараметрыРаботыПрограммы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПодпискиПолучателей" 

	Дано Я открываю основную форму списка регистра сведений "ПодпискиПолучателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодпискиПолучателей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПодпискиПолучателей"

	Дано Я открываю основную форму регистра сведений "ПодпискиПолучателей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПодпискиПолучателей"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПользовательскиеМакетыПечати" 

	Дано Я открываю основную форму списка регистра сведений "ПользовательскиеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеМакетыПечати"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПользовательскиеМакетыПечати"

	Дано Я открываю основную форму регистра сведений "ПользовательскиеМакетыПечати"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеМакетыПечати"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПользовательскиеНастройкиДоступаКОбработкам" 

	Дано Я открываю основную форму списка регистра сведений "ПользовательскиеНастройкиДоступаКОбработкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеНастройкиДоступаКОбработкам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПользовательскиеНастройкиДоступаКОбработкам"

	Дано Я открываю основную форму регистра сведений "ПользовательскиеНастройкиДоступаКОбработкам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПользовательскиеНастройкиДоступаКОбработкам"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПоставляемыеДанныеТребующиеОбработки" 

	Дано Я открываю основную форму списка регистра сведений "ПоставляемыеДанныеТребующиеОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеДанныеТребующиеОбработки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПоставляемыеДанныеТребующиеОбработки"

	Дано Я открываю основную форму регистра сведений "ПоставляемыеДанныеТребующиеОбработки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПоставляемыеДанныеТребующиеОбработки"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПраваРолей" 

	Дано Я открываю основную форму списка регистра сведений "ПраваРолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваРолей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПраваРолей"

	Дано Я открываю основную форму регистра сведений "ПраваРолей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПраваРолей"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПравилаДляОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "ПравилаДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаДляОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПравилаДляОбменаДанными"

	Дано Я открываю основную форму регистра сведений "ПравилаДляОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПравилаДляОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПредметыПапкиВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "ПредметыПапкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредметыПапкиВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПредметыПапкиВзаимодействий"

	Дано Я открываю основную форму регистра сведений "ПредметыПапкиВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредметыПапкиВзаимодействий"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПредопределенныеВариантыОтчетовВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "ПредопределенныеВариантыОтчетовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредопределенныеВариантыОтчетовВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПредопределенныеВариантыОтчетовВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "ПредопределенныеВариантыОтчетовВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПредопределенныеВариантыОтчетовВерсийРасширений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПричиныИзмененияАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "ПричиныИзмененияАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПричиныИзмененияАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПричиныИзмененияАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "ПричиныИзмененияАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПричиныИзмененияАдресныхСведений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПроцессыДляЗапуска" 

	Дано Я открываю основную форму списка регистра сведений "ПроцессыДляЗапуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцессыДляЗапуска"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПроцессыДляЗапуска"

	Дано Я открываю основную форму регистра сведений "ПроцессыДляЗапуска"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПроцессыДляЗапуска"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПсевдонимыПредопределенныхУзлов" 

	Дано Я открываю основную форму списка регистра сведений "ПсевдонимыПредопределенныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПсевдонимыПредопределенныхУзлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПсевдонимыПредопределенныхУзлов"

	Дано Я открываю основную форму регистра сведений "ПсевдонимыПредопределенныхУзлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПсевдонимыПредопределенныхУзлов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПубличныеИдентификаторыСинхронизируемыхОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПубличныеИдентификаторыСинхронизируемыхОбъектов"

	Дано Я открываю основную форму регистра сведений "ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПубличныеИдентификаторыСинхронизируемыхОбъектов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux" 

	Дано Я открываю основную форму списка регистра сведений "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"

	Дано Я открываю основную форму регистра сведений "ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПутиКПрограммамЭлектроннойПодписиИШифрованияНаСерверахLinux"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "РабочиеКаталогиФайлов" 

	Дано Я открываю основную форму списка регистра сведений "РабочиеКаталогиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РабочиеКаталогиФайлов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "РабочиеКаталогиФайлов"

	Дано Я открываю основную форму регистра сведений "РабочиеКаталогиФайлов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РабочиеКаталогиФайлов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "РазрешенияНаИспользованиеВнешнихРесурсов" 

	Дано Я открываю основную форму списка регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "РазрешенияНаИспользованиеВнешнихРесурсов"

	Дано Я открываю основную форму регистра сведений "РазрешенияНаИспользованиеВнешнихРесурсов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РазрешенияНаИспользованиеВнешнихРесурсов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "РежимыПодключенияВнешнихМодулей" 

	Дано Я открываю основную форму списка регистра сведений "РежимыПодключенияВнешнихМодулей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "РежимыПодключенияВнешнихМодулей"

	Дано Я открываю основную форму регистра сведений "РежимыПодключенияВнешнихМодулей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РежимыПодключенияВнешнихМодулей"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "РезультатыОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "РезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "РезультатыОбменаДанными"

	Дано Я открываю основную форму регистра сведений "РезультатыОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "РезультатыПроверкиУчета" 

	Дано Я открываю основную форму списка регистра сведений "РезультатыПроверкиУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыПроверкиУчета"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "РезультатыПроверкиУчета"

	Дано Я открываю основную форму регистра сведений "РезультатыПроверкиУчета"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РезультатыПроверкиУчета"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "РейтингАктивностиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "РейтингАктивностиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РейтингАктивностиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "РейтингАктивностиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "РейтингАктивностиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РейтингАктивностиОбластейДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "РучныеИзмененияГрафиковРаботы" 

	Дано Я открываю основную форму списка регистра сведений "РучныеИзмененияГрафиковРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РучныеИзмененияГрафиковРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "РучныеИзмененияГрафиковРаботы"

	Дано Я открываю основную форму регистра сведений "РучныеИзмененияГрафиковРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений РучныеИзмененияГрафиковРаботы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СведенияОПользователях" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОПользователях"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СведенияОПользователях"

	Дано Я открываю основную форму регистра сведений "СведенияОПользователях"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОПользователях"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СведенияОФайлах" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОФайлах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОФайлах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СведенияОФайлах"

	Дано Я открываю основную форму регистра сведений "СведенияОФайлах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОФайлах"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СеансыВерсийРасширений" 

	Дано Я открываю основную форму списка регистра сведений "СеансыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СеансыВерсийРасширений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СеансыВерсийРасширений"

	Дано Я открываю основную форму регистра сведений "СеансыВерсийРасширений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СеансыВерсийРасширений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СертификатыШифрования" 

	Дано Я открываю основную форму списка регистра сведений "СертификатыШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыШифрования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СертификатыШифрования"

	Дано Я открываю основную форму регистра сведений "СертификатыШифрования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СертификатыШифрования"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СклоненияПредставленийОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "СклоненияПредставленийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СклоненияПредставленийОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СклоненияПредставленийОбъектов"

	Дано Я открываю основную форму регистра сведений "СклоненияПредставленийОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СклоненияПредставленийОбъектов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СлужебныеАдресныеСведения" 

	Дано Я открываю основную форму списка регистра сведений "СлужебныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СлужебныеАдресныеСведения"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СлужебныеАдресныеСведения"

	Дано Я открываю основную форму регистра сведений "СлужебныеАдресныеСведения"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СлужебныеАдресныеСведения"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СогласияНаОбработкуПерсональныхДанных" 

	Дано Я открываю основную форму списка регистра сведений "СогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СогласияНаОбработкуПерсональныхДанных"

	Дано Я открываю основную форму регистра сведений "СогласияНаОбработкуПерсональныхДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СогласияНаОбработкуПерсональныхДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СообщенияОбменаДанными" 

	Дано Я открываю основную форму списка регистра сведений "СообщенияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СообщенияОбменаДанными"

	Дано Я открываю основную форму регистра сведений "СообщенияОбменаДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СообщенияОбменаДанными"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СоответствияОбъектовИнформационныхБаз" 

	Дано Я открываю основную форму списка регистра сведений "СоответствияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СоответствияОбъектовИнформационныхБаз"

	Дано Я открываю основную форму регистра сведений "СоответствияОбъектовИнформационныхБаз"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоответствияОбъектовИнформационныхБаз"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СоставыГруппПользователей" 

	Дано Я открываю основную форму списка регистра сведений "СоставыГруппПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставыГруппПользователей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СоставыГруппПользователей"

	Дано Я открываю основную форму регистра сведений "СоставыГруппПользователей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СоставыГруппПользователей"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СостоянияКонтактовВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияКонтактовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтактовВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СостоянияКонтактовВзаимодействий"

	Дано Я открываю основную форму регистра сведений "СостоянияКонтактовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияКонтактовВзаимодействий"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СостоянияОбменовДанными" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СостоянияОбменовДанными"

	Дано Я открываю основную форму регистра сведений "СостоянияОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияОбменовДанными"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СостоянияПапокПисем" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПапокПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПапокПисем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СостоянияПапокПисем"

	Дано Я открываю основную форму регистра сведений "СостоянияПапокПисем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПапокПисем"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СостоянияПредметовВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияПредметовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПредметовВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СостоянияПредметовВзаимодействий"

	Дано Я открываю основную форму регистра сведений "СостоянияПредметовВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияПредметовВзаимодействий"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СостоянияРассылокОтчетов" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияРассылокОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияРассылокОтчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СостоянияРассылокОтчетов"

	Дано Я открываю основную форму регистра сведений "СостоянияРассылокОтчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияРассылокОтчетов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СостоянияУспешныхОбменовДанными" 

	Дано Я открываю основную форму списка регистра сведений "СостоянияУспешныхОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДанными"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СостоянияУспешныхОбменовДанными"

	Дано Я открываю основную форму регистра сведений "СостоянияУспешныхОбменовДанными"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СостоянияУспешныхОбменовДанными"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СтатистикаКонфигурации" 

	Дано Я открываю основную форму списка регистра сведений "СтатистикаКонфигурации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаКонфигурации"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СтатистикаКонфигурации"

	Дано Я открываю основную форму регистра сведений "СтатистикаКонфигурации"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатистикаКонфигурации"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СтатусыСинхронизацииФайловСОблачнымСервисом" 

	Дано Я открываю основную форму списка регистра сведений "СтатусыСинхронизацииФайловСОблачнымСервисом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыСинхронизацииФайловСОблачнымСервисом"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СтатусыСинхронизацииФайловСОблачнымСервисом"

	Дано Я открываю основную форму регистра сведений "СтатусыСинхронизацииФайловСОблачнымСервисом"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СтатусыСинхронизацииФайловСОблачнымСервисом"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ТаблицыГруппДоступа" 

	Дано Я открываю основную форму списка регистра сведений "ТаблицыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТаблицыГруппДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ТаблицыГруппДоступа"

	Дано Я открываю основную форму регистра сведений "ТаблицыГруппДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ТаблицыГруппДоступа"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УведомленияОПрочтении" 

	Дано Я открываю основную форму списка регистра сведений "УведомленияОПрочтении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УведомленияОПрочтении"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УведомленияОПрочтении"

	Дано Я открываю основную форму регистра сведений "УведомленияОПрочтении"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УведомленияОПрочтении"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "Удалить_АктивныеПредметыВзаимодействий" 

	Дано Я открываю основную форму списка регистра сведений "Удалить_АктивныеПредметыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Удалить_АктивныеПредметыВзаимодействий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "Удалить_АктивныеПредметыВзаимодействий"

	Дано Я открываю основную форму регистра сведений "Удалить_АктивныеПредметыВзаимодействий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений Удалить_АктивныеПредметыВзаимодействий"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьАдресныйКлассификатор" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьАдресныйКлассификатор"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьАдресныйКлассификатор"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьАдресныйКлассификатор"

	Дано Я открываю основную форму регистра сведений "УдалитьАдресныйКлассификатор"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьАдресныйКлассификатор"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьБлокировкиСеансовОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьБлокировкиСеансовОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьБлокировкиСеансовОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьБлокировкиСеансовОбластиДанных"

	Дано Я открываю основную форму регистра сведений "УдалитьБлокировкиСеансовОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьБлокировкиСеансовОбластиДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьВерсииПодсистем" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВерсииПодсистем"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьВерсииПодсистем"

	Дано Я открываю основную форму регистра сведений "УдалитьВерсииПодсистем"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьВерсииПодсистем"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьГруппыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГруппыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьГруппыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "УдалитьГруппыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьГруппыЗначенийДоступа"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьЗамерыВремени" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗамерыВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьЗамерыВремени"

	Дано Я открываю основную форму регистра сведений "УдалитьЗамерыВремени"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьЗамерыВремени2" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗамерыВремени2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени2"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьЗамерыВремени2"

	Дано Я открываю основную форму регистра сведений "УдалитьЗамерыВремени2"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени2"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьЗамерыВремени3" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗамерыВремени3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени3"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьЗамерыВремени3"

	Дано Я открываю основную форму регистра сведений "УдалитьЗамерыВремени3"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремени3"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьЗамерыВремениТехнологические" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремениТехнологические"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьЗамерыВремениТехнологические"

	Дано Я открываю основную форму регистра сведений "УдалитьЗамерыВремениТехнологические"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьЗамерыВремениТехнологические"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьНаборыЗначенийДоступа" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНаборыЗначенийДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьНаборыЗначенийДоступа"

	Дано Я открываю основную форму регистра сведений "УдалитьНаборыЗначенийДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНаборыЗначенийДоступа"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьНастройкиВерсионированияОбъектов" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьНастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьНастройкиВерсионированияОбъектов"

	Дано Я открываю основную форму регистра сведений "УдалитьНастройкиВерсионированияОбъектов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьНастройкиВерсионированияОбъектов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьОбластиДанных" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьОбластиДанных"

	Дано Я открываю основную форму регистра сведений "УдалитьОбластиДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьОбластиКРезервномуКопированию" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОбластиКРезервномуКопированию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиКРезервномуКопированию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьОбластиКРезервномуКопированию"

	Дано Я открываю основную форму регистра сведений "УдалитьОбластиКРезервномуКопированию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОбластиКРезервномуКопированию"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьОчередьЗаданий" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОчередьЗаданий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьОчередьЗаданий"

	Дано Я открываю основную форму регистра сведений "УдалитьОчередьЗаданий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОчередьЗаданий"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьОчередьИзвлеченияТекста" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОчередьИзвлеченияТекста"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьОчередьИзвлеченияТекста"

	Дано Я открываю основную форму регистра сведений "УдалитьОчередьИзвлеченияТекста"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьОчередьИзвлеченияТекста"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьПраваПоЗначениямДоступа" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьПраваПоЗначениямДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПраваПоЗначениямДоступа"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьПраваПоЗначениямДоступа"

	Дано Я открываю основную форму регистра сведений "УдалитьПраваПоЗначениямДоступа"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьПраваПоЗначениямДоступа"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьРейтингАктивностиОбластейДанных" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьРейтингАктивностиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРейтингАктивностиОбластейДанных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьРейтингАктивностиОбластейДанных"

	Дано Я открываю основную форму регистра сведений "УдалитьРейтингАктивностиОбластейДанных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьРейтингАктивностиОбластейДанных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьСтраныМира" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьСтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтраныМира"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьСтраныМира"

	Дано Я открываю основную форму регистра сведений "УдалитьСтраныМира"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьСтраныМира"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УдалитьХранимыеФайлыВерсий" 

	Дано Я открываю основную форму списка регистра сведений "УдалитьХранимыеФайлыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьХранимыеФайлыВерсий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УдалитьХранимыеФайлыВерсий"

	Дано Я открываю основную форму регистра сведений "УдалитьХранимыеФайлыВерсий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УдалитьХранимыеФайлыВерсий"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "УровниСокращенийАдресныхСведений" 

	Дано Я открываю основную форму списка регистра сведений "УровниСокращенийАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УровниСокращенийАдресныхСведений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "УровниСокращенийАдресныхСведений"

	Дано Я открываю основную форму регистра сведений "УровниСокращенийАдресныхСведений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений УровниСокращенийАдресныхСведений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ФайлыВРабочемКаталоге" 

	Дано Я открываю основную форму списка регистра сведений "ФайлыВРабочемКаталоге"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыВРабочемКаталоге"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ФайлыВРабочемКаталоге"

	Дано Я открываю основную форму регистра сведений "ФайлыВРабочемКаталоге"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ФайлыВРабочемКаталоге"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ЭлектронныеПодписи" 

	Дано Я открываю основную форму списка регистра сведений "ЭлектронныеПодписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЭлектронныеПодписи"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ЭлектронныеПодписи"

	Дано Я открываю основную форму регистра сведений "ЭлектронныеПодписи"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ЭлектронныеПодписи"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_АктуальностьДанныхТерминалов" 

	Дано Я открываю основную форму списка регистра сведений "СД_АктуальностьДанныхТерминалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_АктуальностьДанныхТерминалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_АктуальностьДанныхТерминалов"

	Дано Я открываю основную форму регистра сведений "СД_АктуальностьДанныхТерминалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_АктуальностьДанныхТерминалов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПривязкиТерминалов" 

	Дано Я открываю основную форму списка регистра сведений "СД_ПривязкиТерминалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПривязкиТерминалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПривязкиТерминалов"

	Дано Я открываю основную форму регистра сведений "СД_ПривязкиТерминалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПривязкиТерминалов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ГрафикОбслуживания" 

	Дано Я открываю основную форму списка регистра сведений "СД_ГрафикОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ГрафикОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ГрафикОбслуживания"

	Дано Я открываю основную форму регистра сведений "СД_ГрафикОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ГрафикОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "удСД_ГрафикОбслуженных" 

	Дано Я открываю основную форму списка регистра сведений "удСД_ГрафикОбслуженных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений удСД_ГрафикОбслуженных"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "удСД_ГрафикОбслуженных"

	Дано Я открываю основную форму регистра сведений "удСД_ГрафикОбслуженных"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений удСД_ГрафикОбслуженных"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ГрафикиРаботы" 

	Дано Я открываю основную форму списка регистра сведений "СД_ГрафикиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ГрафикиРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ГрафикиРаботы"

	Дано Я открываю основную форму регистра сведений "СД_ГрафикиРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ГрафикиРаботы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Инструктаж" 

	Дано Я открываю основную форму списка регистра сведений "СД_Инструктаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_Инструктаж"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Инструктаж"

	Дано Я открываю основную форму регистра сведений "СД_Инструктаж"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_Инструктаж"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ИнструктажПройденный" 

	Дано Я открываю основную форму списка регистра сведений "СД_ИнструктажПройденный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ИнструктажПройденный"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ИнструктажПройденный"

	Дано Я открываю основную форму регистра сведений "СД_ИнструктажПройденный"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ИнструктажПройденный"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПривязкиИнфраструктуры" 

	Дано Я открываю основную форму списка регистра сведений "СД_ПривязкиИнфраструктуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПривязкиИнфраструктуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПривязкиИнфраструктуры"

	Дано Я открываю основную форму регистра сведений "СД_ПривязкиИнфраструктуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПривязкиИнфраструктуры"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПараметрыДанныхВвода" 

	Дано Я открываю основную форму списка регистра сведений "СД_ПараметрыДанныхВвода"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПараметрыДанныхВвода"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПараметрыДанныхВвода"

	Дано Я открываю основную форму регистра сведений "СД_ПараметрыДанныхВвода"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПараметрыДанныхВвода"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПараметрыОбменаДаннымиWiFi" 

	Дано Я открываю основную форму списка регистра сведений "СД_ПараметрыОбменаДаннымиWiFi"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПараметрыОбменаДаннымиWiFi"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПараметрыОбменаДаннымиWiFi"

	Дано Я открываю основную форму регистра сведений "СД_ПараметрыОбменаДаннымиWiFi"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПараметрыОбменаДаннымиWiFi"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ТекущиеКадровыеДанныеСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "СД_ТекущиеКадровыеДанныеСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ТекущиеКадровыеДанныеСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ТекущиеКадровыеДанныеСотрудников"

	Дано Я открываю основную форму регистра сведений "СД_ТекущиеКадровыеДанныеСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ТекущиеКадровыеДанныеСотрудников"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ДокументыФизическихЛиц" 

	Дано Я открываю основную форму списка регистра сведений "СД_ДокументыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ДокументыФизическихЛиц"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ДокументыФизическихЛиц"

	Дано Я открываю основную форму регистра сведений "СД_ДокументыФизическихЛиц"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ДокументыФизическихЛиц"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ДанныеПользователейМП" 

	Дано Я открываю основную форму списка регистра сведений "СД_ДанныеПользователейМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ДанныеПользователейМП"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ДанныеПользователейМП"

	Дано Я открываю основную форму регистра сведений "СД_ДанныеПользователейМП"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ДанныеПользователейМП"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_СтатусОбменаДаннымиWiFi" 

	Дано Я открываю основную форму списка регистра сведений "СД_СтатусОбменаДаннымиWiFi"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СтатусОбменаДаннымиWiFi"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СтатусОбменаДаннымиWiFi"

	Дано Я открываю основную форму регистра сведений "СД_СтатусОбменаДаннымиWiFi"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СтатусОбменаДаннымиWiFi"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПривязкиТерриторий" 

	Дано Я открываю основную форму списка регистра сведений "СД_ПривязкиТерриторий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПривязкиТерриторий"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПривязкиТерриторий"

	Дано Я открываю основную форму регистра сведений "СД_ПривязкиТерриторий"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПривязкиТерриторий"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_История" 

	Дано Я открываю основную форму списка регистра сведений "СД_История"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_История"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_История"

	Дано Я открываю основную форму регистра сведений "СД_История"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_История"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ГрафикОтсутствияСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "СД_ГрафикОтсутствияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ГрафикОтсутствияСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ГрафикОтсутствияСотрудников"

	Дано Я открываю основную форму регистра сведений "СД_ГрафикОтсутствияСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ГрафикОтсутствияСотрудников"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_СообщенияPushУведомлений" 

	Дано Я открываю основную форму списка регистра сведений "СД_СообщенияPushУведомлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СообщенияPushУведомлений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СообщенияPushУведомлений"

	Дано Я открываю основную форму регистра сведений "СД_СообщенияPushУведомлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СообщенияPushУведомлений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ОтправленныеСообщенияPushУведомлений" 

	Дано Я открываю основную форму списка регистра сведений "СД_ОтправленныеСообщенияPushУведомлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ОтправленныеСообщенияPushУведомлений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОтправленныеСообщенияPushУведомлений"

	Дано Я открываю основную форму регистра сведений "СД_ОтправленныеСообщенияPushУведомлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ОтправленныеСообщенияPushУведомлений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_PushID" 

	Дано Я открываю основную форму списка регистра сведений "СД_PushID"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_PushID"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_PushID"

	Дано Я открываю основную форму регистра сведений "СД_PushID"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_PushID"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ОчередьДанныхНаОбработку" 

	Дано Я открываю основную форму списка регистра сведений "СД_ОчередьДанныхНаОбработку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ОчередьДанныхНаОбработку"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОчередьДанныхНаОбработку"

	Дано Я открываю основную форму регистра сведений "СД_ОчередьДанныхНаОбработку"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ОчередьДанныхНаОбработку"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ЗадолженностьПотребителей" 

	Дано Я открываю основную форму списка регистра сведений "СД_ЗадолженностьПотребителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ЗадолженностьПотребителей"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЗадолженностьПотребителей"

	Дано Я открываю основную форму регистра сведений "СД_ЗадолженностьПотребителей"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ЗадолженностьПотребителей"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ОплаченныеПоказанияСчетчика" 

	Дано Я открываю основную форму списка регистра сведений "СД_ОплаченныеПоказанияСчетчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ОплаченныеПоказанияСчетчика"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ОплаченныеПоказанияСчетчика"

	Дано Я открываю основную форму регистра сведений "СД_ОплаченныеПоказанияСчетчика"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ОплаченныеПоказанияСчетчика"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ЦеныНоменклатуры" 

	Дано Я открываю основную форму списка регистра сведений "СД_ЦеныНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ЦеныНоменклатуры"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЦеныНоменклатуры"

	Дано Я открываю основную форму регистра сведений "СД_ЦеныНоменклатуры"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ЦеныНоменклатуры"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_НастройкиPushУведомлений" 

	Дано Я открываю основную форму списка регистра сведений "СД_НастройкиPushУведомлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_НастройкиPushУведомлений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_НастройкиPushУведомлений"

	Дано Я открываю основную форму регистра сведений "СД_НастройкиPushУведомлений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_НастройкиPushУведомлений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_СообщенияСМС" 

	Дано Я открываю основную форму списка регистра сведений "СД_СообщенияСМС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СообщенияСМС"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СообщенияСМС"

	Дано Я открываю основную форму регистра сведений "СД_СообщенияСМС"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СообщенияСМС"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ИсторияНаМУ" 

	Дано Я открываю основную форму списка регистра сведений "СД_ИсторияНаМУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ИсторияНаМУ"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ИсторияНаМУ"

	Дано Я открываю основную форму регистра сведений "СД_ИсторияНаМУ"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ИсторияНаМУ"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ГрафикиРаботыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "СД_ГрафикиРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ГрафикиРаботыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ГрафикиРаботыСотрудников"

	Дано Я открываю основную форму регистра сведений "СД_ГрафикиРаботыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ГрафикиРаботыСотрудников"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_СтатусыЗадачПоОбъектамОбслуживания" 

	Дано Я открываю основную форму списка регистра сведений "СД_СтатусыЗадачПоОбъектамОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СтатусыЗадачПоОбъектамОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СтатусыЗадачПоОбъектамОбслуживания"

	Дано Я открываю основную форму регистра сведений "СД_СтатусыЗадачПоОбъектамОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СтатусыЗадачПоОбъектамОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_РезервыСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "СД_РезервыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_РезервыСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_РезервыСотрудников"

	Дано Я открываю основную форму регистра сведений "СД_РезервыСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_РезервыСотрудников"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ВремяВыполненияЗадач" 

	Дано Я открываю основную форму списка регистра сведений "СД_ВремяВыполненияЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ВремяВыполненияЗадач"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВремяВыполненияЗадач"

	Дано Я открываю основную форму регистра сведений "СД_ВремяВыполненияЗадач"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ВремяВыполненияЗадач"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_СтатусыОбъектовОбслуживания" 

	Дано Я открываю основную форму списка регистра сведений "СД_СтатусыОбъектовОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СтатусыОбъектовОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СтатусыОбъектовОбслуживания"

	Дано Я открываю основную форму регистра сведений "СД_СтатусыОбъектовОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СтатусыОбъектовОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_НазначенныеЗадачиСотрудникам" 

	Дано Я открываю основную форму списка регистра сведений "СД_НазначенныеЗадачиСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_НазначенныеЗадачиСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_НазначенныеЗадачиСотрудникам"

	Дано Я открываю основную форму регистра сведений "СД_НазначенныеЗадачиСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_НазначенныеЗадачиСотрудникам"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_КоэффициентНапряженностиПлана" 

	Дано Я открываю основную форму списка регистра сведений "СД_КоэффициентНапряженностиПлана"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_КоэффициентНапряженностиПлана"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_КоэффициентНапряженностиПлана"

	Дано Я открываю основную форму регистра сведений "СД_КоэффициентНапряженностиПлана"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_КоэффициентНапряженностиПлана"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ВремяДоступностиСотрудников" 

	Дано Я открываю основную форму списка регистра сведений "СД_ВремяДоступностиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ВремяДоступностиСотрудников"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВремяДоступностиСотрудников"

	Дано Я открываю основную форму регистра сведений "СД_ВремяДоступностиСотрудников"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ВремяДоступностиСотрудников"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Маршруты" 

	Дано Я открываю основную форму списка регистра сведений "СД_Маршруты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_Маршруты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Маршруты"

	Дано Я открываю основную форму регистра сведений "СД_Маршруты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_Маршруты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ДанныеТерминалов" 

	Дано Я открываю основную форму списка регистра сведений "СД_ДанныеТерминалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ДанныеТерминалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ДанныеТерминалов"

	Дано Я открываю основную форму регистра сведений "СД_ДанныеТерминалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ДанныеТерминалов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПоказанияСчетчиков" 

	Дано Я открываю основную форму списка регистра сведений "СД_ПоказанияСчетчиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПоказанияСчетчиков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПоказанияСчетчиков"

	Дано Я открываю основную форму регистра сведений "СД_ПоказанияСчетчиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПоказанияСчетчиков"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_РаспределенныеЗадачиСотрудникам" 

	Дано Я открываю основную форму списка регистра сведений "СД_РаспределенныеЗадачиСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_РаспределенныеЗадачиСотрудникам"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_РаспределенныеЗадачиСотрудникам"

	Дано Я открываю основную форму регистра сведений "СД_РаспределенныеЗадачиСотрудникам"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_РаспределенныеЗадачиСотрудникам"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПосещениеГеозон" 

	Дано Я открываю основную форму списка регистра сведений "СД_ПосещениеГеозон"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПосещениеГеозон"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПосещениеГеозон"

	Дано Я открываю основную форму регистра сведений "СД_ПосещениеГеозон"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПосещениеГеозон"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СведенияОМобильныхКлиентах" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОМобильныхКлиентах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОМобильныхКлиентах"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СведенияОМобильныхКлиентах"

	Дано Я открываю основную форму регистра сведений "СведенияОМобильныхКлиентах"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОМобильныхКлиентах"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СведенияОСообщенияхОбменаСМобильнымиКлиентами" 

	Дано Я открываю основную форму списка регистра сведений "СведенияОСообщенияхОбменаСМобильнымиКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОСообщенияхОбменаСМобильнымиКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СведенияОСообщенияхОбменаСМобильнымиКлиентами"

	Дано Я открываю основную форму регистра сведений "СведенияОСообщенияхОбменаСМобильнымиКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СведенияОСообщенияхОбменаСМобильнымиКлиентами"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "ПротоколРаботыСМобильнымиКлиентами" 

	Дано Я открываю основную форму списка регистра сведений "ПротоколРаботыСМобильнымиКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПротоколРаботыСМобильнымиКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "ПротоколРаботыСМобильнымиКлиентами"

	Дано Я открываю основную форму регистра сведений "ПротоколРаботыСМобильнымиКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений ПротоколРаботыСМобильнымиКлиентами"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПротоколОбменаСМобильнымиКлиентами" 

	Дано Я открываю основную форму списка регистра сведений "СД_ПротоколОбменаСМобильнымиКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПротоколОбменаСМобильнымиКлиентами"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПротоколОбменаСМобильнымиКлиентами"

	Дано Я открываю основную форму регистра сведений "СД_ПротоколОбменаСМобильнымиКлиентами"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПротоколОбменаСМобильнымиКлиентами"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_АктуальныеДанныеДатчиков" 

	Дано Я открываю основную форму списка регистра сведений "СД_АктуальныеДанныеДатчиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_АктуальныеДанныеДатчиков"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_АктуальныеДанныеДатчиков"

	Дано Я открываю основную форму регистра сведений "СД_АктуальныеДанныеДатчиков"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_АктуальныеДанныеДатчиков"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ЛогЗавершенияДня" 

	Дано Я открываю основную форму списка регистра сведений "СД_ЛогЗавершенияДня"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ЛогЗавершенияДня"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЛогЗавершенияДня"

	Дано Я открываю основную форму регистра сведений "СД_ЛогЗавершенияДня"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ЛогЗавершенияДня"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ЗадачиКЗавершению" 

	Дано Я открываю основную форму списка регистра сведений "СД_ЗадачиКЗавершению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ЗадачиКЗавершению"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЗадачиКЗавершению"

	Дано Я открываю основную форму регистра сведений "СД_ЗадачиКЗавершению"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ЗадачиКЗавершению"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПривязкиПечатныхФорм" 

	Дано Я открываю основную форму списка регистра сведений "СД_ПривязкиПечатныхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПривязкиПечатныхФорм"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПривязкиПечатныхФорм"

	Дано Я открываю основную форму регистра сведений "СД_ПривязкиПечатныхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПривязкиПечатныхФорм"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ДополнительныеРеквизитыПечатныхФорм" 

	Дано Я открываю основную форму списка регистра сведений "СД_ДополнительныеРеквизитыПечатныхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ДополнительныеРеквизитыПечатныхФорм"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ДополнительныеРеквизитыПечатныхФорм"

	Дано Я открываю основную форму регистра сведений "СД_ДополнительныеРеквизитыПечатныхФорм"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ДополнительныеРеквизитыПечатныхФорм"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ДатчикиТелеметрии" 

	Дано Я открываю основную форму списка регистра сведений "СД_ДатчикиТелеметрии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ДатчикиТелеметрии"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ДатчикиТелеметрии"

	Дано Я открываю основную форму регистра сведений "СД_ДатчикиТелеметрии"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ДатчикиТелеметрии"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ИконкиСооружений" 

	Дано Я открываю основную форму списка регистра сведений "СД_ИконкиСооружений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ИконкиСооружений"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ИконкиСооружений"

	Дано Я открываю основную форму регистра сведений "СД_ИконкиСооружений"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ИконкиСооружений"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ЛьготыЛицевыхСчетов" 

	Дано Я открываю основную форму списка регистра сведений "СД_ЛьготыЛицевыхСчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ЛьготыЛицевыхСчетов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ЛьготыЛицевыхСчетов"

	Дано Я открываю основную форму регистра сведений "СД_ЛьготыЛицевыхСчетов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ЛьготыЛицевыхСчетов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Пломбы" 

	Дано Я открываю основную форму списка регистра сведений "СД_Пломбы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_Пломбы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Пломбы"

	Дано Я открываю основную форму регистра сведений "СД_Пломбы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_Пломбы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_СписокЗапрещенЗапретОбменаМобильные" 

	Дано Я открываю основную форму списка регистра сведений "СД_СписокЗапрещенЗапретОбменаМобильные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СписокЗапрещенЗапретОбменаМобильные"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СписокЗапрещенЗапретОбменаМобильные"

	Дано Я открываю основную форму регистра сведений "СД_СписокЗапрещенЗапретОбменаМобильные"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СписокЗапрещенЗапретОбменаМобильные"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_СтатусыСообщенийОбмена" 

	Дано Я открываю основную форму списка регистра сведений "СД_СтатусыСообщенийОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СтатусыСообщенийОбмена"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СтатусыСообщенийОбмена"

	Дано Я открываю основную форму регистра сведений "СД_СтатусыСообщенийОбмена"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СтатусыСообщенийОбмена"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПланОбслуживания" 

	Дано Я открываю основную форму списка регистра сведений "СД_ПланОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПланОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПланОбслуживания"

	Дано Я открываю основную форму регистра сведений "СД_ПланОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПланОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПериодичностьВыполненияРабот" 

	Дано Я открываю основную форму списка регистра сведений "СД_ПериодичностьВыполненияРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПериодичностьВыполненияРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПериодичностьВыполненияРабот"

	Дано Я открываю основную форму регистра сведений "СД_ПериодичностьВыполненияРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПериодичностьВыполненияРабот"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "удСД_ВыполненныеРаботы" 

	Дано Я открываю основную форму списка регистра сведений "удСД_ВыполненныеРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений удСД_ВыполненныеРаботы"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "удСД_ВыполненныеРаботы"

	Дано Я открываю основную форму регистра сведений "удСД_ВыполненныеРаботы"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений удСД_ВыполненныеРаботы"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_НормативыТрудоемкости" 

	Дано Я открываю основную форму списка регистра сведений "СД_НормативыТрудоемкости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_НормативыТрудоемкости"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_НормативыТрудоемкости"

	Дано Я открываю основную форму регистра сведений "СД_НормативыТрудоемкости"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_НормативыТрудоемкости"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Оплаты" 

	Дано Я открываю основную форму списка регистра сведений "СД_Оплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_Оплаты"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Оплаты"

	Дано Я открываю основную форму регистра сведений "СД_Оплаты"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_Оплаты"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_Чеки" 

	Дано Я открываю основную форму списка регистра сведений "СД_Чеки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_Чеки"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_Чеки"

	Дано Я открываю основную форму регистра сведений "СД_Чеки"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_Чеки"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ПериодическиеСвойстваОбъектовОбслуживания" 

	Дано Я открываю основную форму списка регистра сведений "СД_ПериодическиеСвойстваОбъектовОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПериодическиеСвойстваОбъектовОбслуживания"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ПериодическиеСвойстваОбъектовОбслуживания"

	Дано Я открываю основную форму регистра сведений "СД_ПериодическиеСвойстваОбъектовОбслуживания"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ПериодическиеСвойстваОбъектовОбслуживания"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ИсторияОтключенийОборудования" 

	Дано Я открываю основную форму списка регистра сведений "СД_ИсторияОтключенийОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ИсторияОтключенийОборудования"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ИсторияОтключенийОборудования"

	Дано Я открываю основную форму регистра сведений "СД_ИсторияОтключенийОборудования"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ИсторияОтключенийОборудования"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ВыполненныеРаботыПоОборудованию" 

	Дано Я открываю основную форму списка регистра сведений "СД_ВыполненныеРаботыПоОборудованию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ВыполненныеРаботыПоОборудованию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВыполненныеРаботыПоОборудованию"

	Дано Я открываю основную форму регистра сведений "СД_ВыполненныеРаботыПоОборудованию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ВыполненныеРаботыПоОборудованию"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_СтатусыПломб" 

	Дано Я открываю основную форму списка регистра сведений "СД_СтатусыПломб"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СтатусыПломб"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_СтатусыПломб"

	Дано Я открываю основную форму регистра сведений "СД_СтатусыПломб"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_СтатусыПломб"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ВыполнениеОперацийПоОборудованию" 

	Дано Я открываю основную форму списка регистра сведений "СД_ВыполнениеОперацийПоОборудованию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ВыполнениеОперацийПоОборудованию"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ВыполнениеОперацийПоОборудованию"

	Дано Я открываю основную форму регистра сведений "СД_ВыполнениеОперацийПоОборудованию"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_ВыполнениеОперацийПоОборудованию"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_РеквизитОтсчетаДатВыполненияРабот" 

	Дано Я открываю основную форму списка регистра сведений "СД_РеквизитОтсчетаДатВыполненияРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_РеквизитОтсчетаДатВыполненияРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_РеквизитОтсчетаДатВыполненияРабот"

	Дано Я открываю основную форму регистра сведений "СД_РеквизитОтсчетаДатВыполненияРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра сведений СД_РеквизитОтсчетаДатВыполненияРабот"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_ТрудоемкостьВыполненныхРабот" 

	Дано Я открываю основную форму списка регистра накопления "СД_ТрудоемкостьВыполненныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СД_ТрудоемкостьВыполненныхРабот"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_ТрудоемкостьВыполненныхРабот"

	Дано Я открываю основную форму регистра накопления "СД_ТрудоемкостьВыполненныхРабот"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СД_ТрудоемкостьВыполненныхРабот"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_УчетМатериалов" 

	Дано Я открываю основную форму списка регистра накопления "СД_УчетМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СД_УчетМатериалов"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_УчетМатериалов"

	Дано Я открываю основную форму регистра накопления "СД_УчетМатериалов"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СД_УчетМатериалов"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
	
Сценарий: Открытие формы списка "СД_УстановленнаяНоменклатура" 

	Дано Я открываю основную форму списка регистра накопления "СД_УстановленнаяНоменклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СД_УстановленнаяНоменклатура"
	И Я закрываю текущее окно

Сценарий: Открытие формы объкта "СД_УстановленнаяНоменклатура"

	Дано Я открываю основную форму регистра накопления "СД_УстановленнаяНоменклатура"
	Если появилось предупреждение тогда
		Тогда я вызываю исключение "Не удалось открыть форму регистра накопления СД_УстановленнаяНоменклатура"
	И Я закрываю текущее окно


Сценарий: Запись нового ...

	Дано ...


Сценарий: Запись существующего

	Дано ...



Сценарий: Ввод на основании

	Дано ...
